#version: 0.2
Ġ Ġ
ä ¸
ï ¼
ï¼ Į
ã Ģ
ç ļ
çļ Ħ
ĠĠ ĠĠ
ä º
Ġ t
æ ľ
å ı
ãĢ Ĥ
i n
å ħ
h e
Ġ a
ä »
å ¤
r e
o n
å Ī
å ®
ãĢ ģ
e r
è ¿
ä ½
å ľ
ç Ķ
å Ĳ
a t
Ġt he
å Ĭ
æ ĺ
Ġ s
ç »
ĠĠĠĠ ĠĠĠĠ
â Ģ
e n
o r
å Ľ
æ Ī
æ ĸ
å ¹
e s
ä ¼
ä ¹
Ġ c
æ Ĺ
i s
è ®
ä¸ Ģ
i t
Ġ o
a l
a n
å °
è ¯
å Ń
å į
æĺ ¯
åľ ¨
Ġ w
Ġ p
Ġ f
å ·
æ Ŀ
æľ ī
å ¸
e d
a r
é ĩ
å Į
å º
in g
äº º
Ġ b
ä¸ Ń
l e
Ġa n
i on
æ ī
Ġo f
å ¼
è ¡
å Ĩ
é Ģ
å Ĵ
Ġ in
è Ģ
r o
å ¾
ä¸ į
å ĩ
i c
ä¸ º
åĴ Į
Ġ m
Ġ d
æ ķ
ç Ľ
ç §
æ Ĭ
å ±
å ¯
äº Ĩ
ĥ ½
Ġt o
è µ
æ ł
å¹ ´
è ´
å¤ §
o u
åĽ ½
è §
ç ī
Ċ ĠĠĠĠĠĠĠĠ
ä¸ ļ
Ġan d
a s
e l
ä» ¥
ç İ
æ Ģ
æ °
é Ļ
æ Ķ
çĶ Ł
åŃ ¦
a c
ç Ĳ
en t
å ¥
e t
s t
ç º
âĢ ľ
è ĩ
âĢ Ŀ
åı ĳ
æ ³
2 0
å ½
çĶ ¨
ä¼ ļ
Ġ \
å ¿
å İ
ä¸ Ĭ
ç Ń
æ Ń
ä ¿
¦ ģ
Ġ =
å ĳ
é Ĺ
ä¸ ª
æ µ
è ĥ½
è ¦ģ
æ İ
æĹ ¶
é Ŀ
å· ¥
Ġ n
o m
ä½ ľ
Ġt h
Ġ h
æ ŀ
i l
è¡ Į
æĪ Ĳ
å ĵ
äº İ
e c
è¿ Ļ
Ċ Ċ
æ ²
Ġ re
i m
æĪ ĳ
é ¢
åı ¯
Ġ e
æ ¯
Ġ l
å Ł
åĪ °
æ ĭ
u t
é ĺ
è ¾
åĩ º
åħ ¬
å¯ ¹
Ġ is
åĪ Ĩ
æĿ ¥
è ½
å® ¶
o l
å ī
æ Į
åľ °
äº §
çĲ Ĩ
u s
o t
i d
a m
å¤ ļ
æ ±
é «
æ ĥ
ç ľ
é« ĺ
Ċ ĠĠĠĠ
çŃ ī
i g
ç «
ä» ¬
æĸ ¹
Ġ T
æĸ °
at ion
åĮ ĸ
ç ®
åĬ ¨
è Ĥ
ä¸ İ
v e
æ Ħ
0 0
ç ½
æ ¸
ä ¾
æ ´
èĩ ª
è¿ Ľ
é ¡
ç ¨
ç» ı
æ ¬
è¿ ĩ
æĹ ¥
u n
u r
åħ ¨
çİ °
Ġ S
ä½ ĵ
æľ º
åĲ Ī
a d
Ġ g
åĲ İ
åĬ Ľ
å¸ Ĥ
ä¸ ĭ
ç ¬
ä» ĸ
é ĥ
å »
é ķ
o w
Ġ 1
æ Ľ
ï¼ ļ
ä¹ Ł
å® ŀ
åĵ ģ
åĲ Į
æľ ¬
u l
å¼ Ģ
æ ı
é ģ
è ģ
Ġf or
å ¦
Ġ A
ï¼ ī
æľ Ī
å® ļ
æ³ ķ
ï¼ Ī
Ġ $
ä¹ ĭ
ç Ļ
å± ķ
æĢ §
è® ¾
åı Ĭ
åħ ¶
ä¸ »
Ġ C
é £
o d
c e
i f
éĥ ¨
Ġ (
å¾ Ĺ
i r
å° ±
éĿ ¢
çĶ µ
l y
v er
å» º
è ¶
åĬ ł
Ġs t
èĢ Į
èĢ ħ
s e
å ¢
é Ľ
c t
å ģ
åľ º
åº ¦
è ī
æ į
u m
åħ ³
éĩ į
ç Ĥ
ç¬ ¬
çī ©
æ Ļ
åĬ ¡
æī Ģ
å¿ ĥ
ç ¤
åī į
éĢ ļ
éķ ¿
è ·
ç Ł
q u
æĸ ĩ
å° Ĩ
Ġb e
åº Ķ
æ° ´
c h
åĨ ħ
ç ł
æı Ĳ
Ġth at
åĪ ¶
Ġ on
a y
èµ Ħ
a g
éĩ ı
åŃ Ĳ
ç ¾
Ġ I
å¦ Ĥ
at e
åĮ º
è °
it h
å¥ ½
ç ©
ç ³
es t
çĽ ®
æ ¶
åı ¸
æĬ Ģ
äº ĭ
Ġ y
æľ Ģ
ç® ¡
è Ĭ
ç¨ ĭ
éĹ ´
ç§ į
å Ŀ
æ¯ Ķ
ä½ į
æķ Ļ
t er
ç ĸ
ç§ ĳ
é ĥ½
é ļ
å Ģ
ç ķ
è® ¡
Ġc on
Ġa s
el f
åĳ ĺ
ä¿ Ŀ
Ġ -
æľ Ł
ãĢ ĭ
æķ °
ãĢ Ĭ
ï¼ Ľ
æľ ¯
åħ¬ åı¸
ç Ŀ
å¹ ¶
è Ĳ
a p
Ġp ro
å §
ç Ĺ
a b
çĽ ¸
å¤ ĸ
åħ ¥
åĽ ł
è¡ ¨
ç³ »
æĽ ´
éĩ ĳ
ç ±
å° ı
ç Ħ
is t
é ľ
æ ģ
åĲ į
e m
r i
æĥ ħ
Ġa re
å¤ ©
Ġ P
h t
é Ķ
ä¸ ī
é ħ
å½ ĵ
re s
çĤ ¹
o s
ec t
Ġ v
æ Ł
ä¿ ¡
åĪ ©
ç ĥ
20 1
r ac
he r
e x
- -
æĪĳ ä»¬
ä¸ ĵ
çī ¹
æĪ ĸ
ä¼ ģ
Ġ M
a in
æ¬ ¡
Ġw ith
ä» İ
å¹ ³
ĠĠ Ġ
ä½ ¿
ä¸Ń åĽ½
åħ ĥ
è´ ¨
o p
éģ ĵ
è¿ ĺ
è¯ ´
ç ¡
er s
o c
å® ī
ĊĠĠĠĠĠĠĠĠ ĠĠĠĠ
æ´ »
æĦ ı
åŁ º
Ġa l
æŃ ¤
é ¦
å·¥ ä½ľ
æĶ ¿
ç ²
é¡ ¹
ĊĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
åıĳ å±ķ
çĲ ĥ
ro m
è ĭ
t h
åı¯ ä»¥
Ġ or
é ĵ
ĠT he
å¸ ¸
Ġw e
ä» £
ç ´
å¼ ı
Ĥ £
ç¾ İ
p l
çĦ ¶
: :
Ġ +
Ġ it
ç½ ĳ
ä¼ģ ä¸ļ
å¾ Ī
æĹ ł
u b
æŀ ľ
èµ Ľ
æį ®
ä½ Ĩ
ä¸Ģ ä¸ª
es s
æĺ İ
( )
i v
an d
éĻ ¢
ç ¥
æ° ĳ
æł ĩ
u p
çł Ķ
è§ Ħ
çĿ Ģ
Ġw h
Ġ r
è į
ou r
å ķ
o re
Ġe x
èµ ·
æ ·
è ĥ
é Ĵ
Ġ B
æľ į
/ /
or t
é£ İ
è½ ¦
k e
æ ¡
æ º
Ġ {
çĶ ±
éĩ Į
å £
åĪ Ľ
ç ¼
å ŀ
åĲ Ħ
æĮ ģ
n t
ä» ¶
æŃ £
è ¢
è Ī
äº Ľ
Ġ 2
it y
ç» Ł
è§ £
m ent
ä¸ ĩ
è İ
å¢ ŀ
å¤ Ħ
Ġ D
éľ Ģ
1 0
åħ ·
å¼ º
éĺ Ł
èģ Ķ
Ċ ĠĠĠ
Ġc om
éĢ ł
il l
åķ Ĩ
å· ²
äº Į
æĬĢ æľ¯
ç» ĵ
è¿ Ĳ
æĬ ¥
u e
æİ ¥
è ¥
Ġ R
èĩ ³
ä½ ł
äº ¤
ç» Ħ
s elf
æ° Ķ
è¥ ¿
Ġ W
ä» »
o g
è Į
Ġ F
çĹ ħ
} {
ç ģ
Ġ H
æµ ģ
Ġb y
Ġ E
çľ ĭ
i es
è¢ «
e w
åį ķ
åį ģ
Ġ us
é¢ ĺ
æĶ ¶
å¯ ¼
f rac
æµ ·
Ġd e
* *
é ª
æ± Ĥ
ä¼ ł
æī ĭ
an g
ç« ĭ
èĤ ²
ig ht
å¤ ĩ
ç Ī
çº §
ä¸ ĸ
é ©
u re
è· ¯
éĹ ¨
i ve
an t
æł ¼
æ² »
æĢ »
Ġ N
åı Ĺ
Ġ he
å½ ±
âĢ Ļ
è º
am e
éĽ Ĩ
åĮ »
åŀ ĭ
åİ Ł
d e
i z
è £
Ġc an
èī ²
çŁ ¥
p t
æĦ Ł
åĲ ĳ
çº ¿
æ »
ä¾ Ľ
æĸ Ļ
æľį åĬ¡
æł ¡
as s
ä¸ ¤
çİ ¯
Ġ\ (
ç®¡ çĲĨ
æł ·
è¾ ¾
ç± »
ä¸ ľ
ç ¦
å ĸ
l d
ç¤ ¾
èº «
Ġ "
å Ļ
i al
çĻ ½
ul t
en d
è Ħ
æº Ĳ
Ġa t
æķ Ī
Ġf rom
Ġ L
ar t
å¹ ¿
åİ »
éĹ ®
åı ĺ
æ £
é¢ Ĩ
çľ ģ
çķ Į
ä¹ Ī
in e
) ,
è¿Ľ è¡Į
æĸ ¯
è¯ ģ
å± ±
åį Ĺ
åħ ±
èĬ Ĥ
ç¤ º
æ² ¡
a ve
äº§ åĵģ
ä¼ ĺ
Ġ G
åŁ İ
åģ ļ
p e
æĥ ³
ä» ·
åĻ ¨
æĬ ķ
p ort
å¸ Ī
èĲ ¥
åħ Ī
å· ±
å¸ ĥ
in d
Ġ le
æģ ¯
Ġn ot
åĮ Ĺ
in t
æĿ ¡
è® ¤
åĽ½ å®¶
éĢ ī
æŀ Ħ
Ġc h
ç© ¶
c l
å ²
æ ¼
åı °
åı ĸ
å® Į
èĢ ĥ
al l
èĩª å·±
å½ ¢
é »
# #
è® ©
åĽ ¢
æ ®
ä¹ ¦
è° ĥ
ion s
ag e
è¾ ĥ
æİ ¨
Ġ 3
åĩ Ĩ
å Ķ
å° ĳ
åı ª
1 9
ç² ¾
T he
è Ļ
Ġ un
åı £
æ³ ¨
æĮ ĩ
é Ĥ£
åĪ «
è¯ ¥
1 2
) .
æĪ ·
åĮ ħ
æ¯ ı
åĬ ŀ
n d
éĻ ħ
f or
æĸ ½
a re
åħ ī
20 2
æĶ ¹
è´ ¹
éĿ ŀ
åĽ ŀ
Ġ im
çłĶ ç©¶
åı Ĥ
çĥ Ń
u d
ä½¿ çĶ¨
ex t
å¸ ¦
æĶ ¯
Ġth is
å® ¹
ï¼ Ł
Ġw as
çĽ ´
å° Ķ
u st
æ· ±
è¿ ĳ
çĸ Ĺ
è§ Ĥ
ç ħ
t o
æĶ ¾
èİ ·
åĽ Ľ
æ ¨
ĉ ĉ
ou t
å¸Ĥ åľº
ä» Ĭ
é¡¹ çĽ®
è§ Ĩ
Ġy ou
Ġ O
åĨ ³
å¢ ĥ
æ ¢
i p
20 0
æĪ ĺ
ç» Ń
èĢ ģ
å® ĥ
ç© º
åĬ ©
Ġh ave
Ġ 0
è® °
u g
æĹ¶ éĹ´
é£ Ł
éĻ Ĳ
ç Ĭ
o st
ç¡ ®
æķ ´
on e
Ġ k
âĢ Ķ
é Ł
e re
æī į
æī ĵ
è¯ ķ
å¤ į
om e
éĢļ è¿ĩ
æ¸ ¸
è£ ħ
å® ¢
å¾ ·
èģ Į
çİ ĩ
_ _
ä½ İ
Ġs h
éª Į
Ġs e
æĺ ĵ
p er
æ Ĥ
ic h
åĬ Ł
è½ ¬
ic al
Ġt r
1 1
æŃ ¥
å± Ģ
çĶŁ äº§
æ²¡ æľī
è ±
éĺ ²
åı ·
ç¥ ŀ
éĢ Ł
ä¹ Ĳ
æĬ ¤
æķĻ èĤ²
é¦ ĸ
ç» Ļ
çº ¦
f f
ç§ °
ar d
åį İ
æ¶ Ī
ä¸ĵ ä¸ļ
at ed
åĳ Ĭ
ç» ´
i b
è¶ ħ
an s
æľ ª
é ¥
è® º
æ¸ ħ
æµ ĭ
è¯ ·
i le
å»º è®¾
æµ İ
æıĲ ä¾Ľ
æĿ Ĳ
ç§ ¯
ä»ĸ ä»¬
äº ¿
at a
è® ®
å¿ «
åĨ į
ac t
el l
) :
æ¨ ¡
ç´ ł
åį ĩ
è®¾ è®¡
æł ¹
è§ ģ
le t
ä¸ĸ çķĮ
åĪ Ĵ
åħ »
å· ŀ
å ¡
éĹ® é¢ĺ
éľĢ è¦ģ
Ġ [
c on
b er
å§ Ķ
Ġ en
å¤ ´
\ [
äº ļ
æĿ ĥ
è¶ Ĭ
åĢ ¼
as t
çľ Ł
å¼ ķ
Ġ U
ç³» ç»Ł
ä¿¡ æģ¯
åŁ Ł
å·¥ ç¨ĭ
åİ Ĩ
Ġp l
è¯ Ĩ
ac k
Ġw or
ç« Ļ
d er
æ ¹
é© ¬
è¶ ³
ä¸» è¦ģ
ç¤¾ ä¼ļ
åĵ į
å¥ ³
ab le
å£ «
è´ £
æİ §
èĩ ´
æ¡ Ī
æŁ ¥
é¢ Ħ
æŀ ģ
ç»ı æµİ
ä½ ķ
äº Ķ
å§ ĭ
a k
Ġre s
æĢ ģ
ou ld
. .
t r
åĳ ¨
çĶŁ æ´»
id e
Ġs p
æİ Ĵ
Ġ j
t her
l o
çī ĩ
å¤§ åŃ¦
åĪ Ļ
Ġa b
i re
çĪ ±
éĩ ĩ
ac h
ä»¥ åıĬ
ä¸ Ķ
a v
èĤ ¡
5 0
c c
ct ion
Ġw he
ĊĊ ĠĠĠĠ
ç ĭ
åħ ĭ
p s
æ¸ ©
åĨ ľ
Ġ 4
åĨ µ
å°± æĺ¯
-- --
åĪ Ĺ
ic e
æĺ ¾
èĬ ±
åı į
ç± ³
æ ĳ
ar g
è¡Į ä¸ļ
åį ı
Ġal l
èī º
åŃ ĺ
o k
st r
at h
æ£ Ģ
éĻ ¤
Ġn e
ä¼ Ĺ
i a
æ Ĥ£
èĮ ĥ
å¿ ħ
Ġwh ich
èį ¯
åĽ ¾
æĸ Ń
æ¼ Ķ
) ;
è ĳ
ï¼ ģ
ç ¢
ä¹ ł
ur n
Ġ '
æĪ ¿
è ŀ
as e
ation s
å± ŀ
âĢĿ ï¼Į
åŃ Ĺ
å¦Ĥ æŀľ
ou nt
im e
c om
Ġa d
res s
Ġ J
éħ į
d u
3 0
éĶ Ģ
ent s
åº ľ
éļ ¾
æ± Ł
} $
æĸĩ åĮĸ
çħ §
çļĦ äºº
åİ ĭ
çĬ ¶
å®ī åħ¨
Ġcom p
on g
æ´» åĬ¨
' s
Ġcon t
an ce
çİ¯ å¢ĥ
éĢ Ĥ
æĬ Ĭ
åģ ¥
ĠI n
åı Ī
` `
è¯ Ń
for m
Ġw ill
åĲĮ æĹ¶
éĩį è¦ģ
éļ ı
\ ]
åĽ½ éĻħ
åŃ £
çļ ®
f t
æĸ¹ éĿ¢
å½± åĵį
è ı
al ue
åı¯ èĥ½
æ ħ
ç ª
äº ¬
y pe
æ² ¹
ç» ĩ
ä¾ ĭ
ç ı
ç¦ »
åĬ ¿
è ħ
ç» Ĩ
åħ ļ
æĻ ¯
ig n
åį ³
ar y
è¿ ŀ
s o
00 0
æĻ º
ãĢĤ âĢĿ
åĽł ä¸º
ä» Ģ
æĢ Ŀ
r t
æľ Ľ
å Ħ
è®¾ å¤ĩ
ä¹ ī
æĭ ī
" "
ä¸Ń å¿ĥ
è¯ Ħ
æĪĲ ä¸º
æŀ Ĺ
å ĭ
Ġp er
è¯ Ŀ
çĽ¸ åħ³
Ġthe ir
u al
ä» ½
æ Ĵ
æ ļ
ou s
ĠT h
åħ· æľī
Ġ$ \
åĩ ł
Ġn um
æ²» çĸĹ
æ» ¡
è® ¸
é ¾
Ġs elf
Ġh as
Ġd o
äº§ ä¸ļ
p ro
en s
æķ° æį®
éĻ į
Ġc l
èĭ ±
åº ·
il d
åĽ Ń
it e
e ar
è¿Ļ ä¸ª
en ce
Ġy our
æ® µ
Ġ x
ç½ ®
çŁ ³
1 5
ä¾ Ŀ
åĳ ½
æī ¿
çī Į
æĺ¯ ä¸Ģ
æĶ¿ åºľ
ac e
a il
it ion
ä» ħ
éŁ ³
us e
å¥ ¹
ä»Ģ ä¹Ī
ä¾ ¿
å¹ ²
æĬķ èµĦ
çļĦ ä¸Ģ
ã ģ
è´ Ł
ä½ľ ä¸º
ç Į
åĦ ¿
åĶ ®
å¥ ĸ
çĻ ¾
çĽ ĳ
èĥ½ åĬĽ
åı ²
èŀ į
æł ¸
1 8
1 6
ç§ĳ æĬĢ
éĿ Ĵ
" ,
æĥħ åĨµ
åİ ¿
åħ¶ ä»ĸ
æĿ ¿
å ĥ
çĽ Ĭ
ç® Ĺ
åĩ ı
a ke
iz e
or d
è± ¡
ä¸į åĲĮ
at er
er t
Â ·
å± Ĥ
Ġa p
ç½ Ĺ
äºº åĳĺ
è ¨
åĢ Ļ
æĿ ĳ
èĲ ½
r y
^ {
è¦ģ æ±Ĥ
å¤ ª
e p
å·² ç»ı
re t
åĿ ĩ
de f
j ect
è¨ Ģ
å® ¤
æĮ ī
æĭ ¬
ä¿ ®
åŁ ¹
ro w
ä¸Ń çļĦ
Ġ V
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ç»Ħ ç»ĩ
å¼ ł
Ġon e
åĪĽ æĸ°
od e
çŃ ĸ
Ġthe y
ç¬¬ ä¸Ģ
v el
è´¨ éĩı
( "
æĺ Ł
åĨ Ľ
åħ į
ä½ ı
è¿Ļ äºĽ
æ¬ ¾
Ġd is
å¾ Ģ
ä¸ ¾
b o
é Ĥ
å¤ ±
g e
å¤Ħ çĲĨ
p le
u ch
éĵ ¶
çİ ĭ
Ġm ore
ç§ĳ åŃ¦
å¥½ çļĦ
Ġm an
åºĶ çĶ¨
or y
åĥ ı
çĽ® åīį
çĶ ³
ä¸ ¥
åĮħ æĭ¬
ç» Ī
Ġst r
e g
çŃ ĳ
çº ¢
Ġo ut
åŃ¦ çĶŁ
å¤§ çļĦ
å¢ŀ éķ¿
m s
éĺ ³
åĪ ĩ
å¾ ®
o ver
åį ļ
åĽ ´
Ġo ther
å ¨
çģ «
æĤ£ èĢħ
åĲ «
Ġ qu
åħ¶ ä¸Ń
æł¹ æį®
äºº çļĦ
åľ Ł
å¤ Ł
äº Ĵ
æ² ³
2 5
t ext
æľī éĻĲ
åı ĭ
Ġ up
èİ· å¾Ĺ
$ ,
æīĢ ä»¥
èµ °
è¯ ¾
äºº æ°ĳ
åı ¤
å® ¡
åįķ ä½į
1 4
åŁİ å¸Ĥ
Ġin t
ow n
æĻ ®
or s
åħ ħ
Ġ &
å¼Ģ å§ĭ
p ut
æ Ĳ
r a
k s
ç® Ģ
Ġs o
Ġ **
âĢĿ ãĢĤ
ã ĥ
Ġ1 9
åĲĪ ä½ľ
ä»¥ ä¸Ĭ
å¯ Į
è¿ ľ
éĥ¨ åĪĨ
Ġ 5
Ġb ut
Ġ K
_ {
åı Į
æłĩ åĩĨ
1 3
äº ī
Ġ âĢľ
g et
å· ´
åĸ Ħ
å¿ µ
åĩº çİ°
éĿŀ å¸¸
æĭ ©
ĠS t
ç¨ İ
å®ŀ çİ°
å¾Ī å¤ļ
Ġs c
å¯¹ äºİ
éĻ ©
6 0
åħ¨ åĽ½
å»º çŃĳ
çº ³
æĿĲ æĸĻ
éħ Ĵ
è¡ Ģ
èī ¯
' ,
æ± ½
åĪ Ŀ
æĹ ©
Ġwe re
åŃ¦ æł¡
er v
å½ ķ
è§ Ĵ
p ub
y s
æĸ¹ å¼ı
çī Ī
åį Ĭ
o int
Ġal so
å¯ Ĩ
æķ ħ
) )
Ġ ro
ç¾ ¤
éĽĨ åĽ¢
å¾ ĭ
ä¹Ł æĺ¯
Ġ *
re f
I n
un d
é» Ħ
åŃ¦ ä¹ł
å£ °
Ġm e
1 7
el y
i e
è¡¨ ç¤º
é¦ Ļ
éĢī æĭ©
ç¦ ı
l ow
i ent
æ¸ ¯
è§Ħ å®ļ
æĭ Ľ
ou nd
ä¸ª äºº
åĿ ļ
æĹ ħ
åħ °
è¿ĩ ç¨ĭ
ic t
éĴ ¢
Ġe v
çĻ½ çĻ
: //
å± ħ
åħ ´
ľ é£İ
re e
ay s
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
è§ ī
çĻ½çĻ ľé£İ
ir st
æıĲ é«ĺ
çĶ »
re d
Ġcom m
o od
åĽł æŃ¤
æī ¹
åī §
o se
è¿Ļ æł·
ç¾İ åĽ½
ç ¯
Ġp art
è´ ¢
åį «
è½ »
å ł
ãĢ Ģ
ç» ľ
ä¸Ģ äºĽ
é¢Ĩ åŁŁ
o b
åį ¡
ç¼ ĸ
if f
at es
éĵ ģ
n ame
æ ¥
é¾ Ļ
æŃ ¢
Ġ\ )
åİ Ĥ
è´ Ń
å¿ Ĺ
åį ł
èĮ ¶
æľīéĻĲ åħ¬åı¸
Ġ if
et h
] (
a x
äº¿ åħĥ
å¸ Į
ing s
æŁ ĵ
çĭ ¬
è® Ń
åģ¥ åº·
w e
æĺ ¥
æľº æŀĦ
on d
é¡ »
é¢ Ŀ
s q
å° ½
è¾ ¹
å¤§ å®¶
åŃ¦ éĻ¢
éĺ ¿
æĪĸ èĢħ
c es
Ġ <
æĸ¹ æ³ķ
å¼Ģ åıĳ
å·¥ ä¸ļ
Ġs y
èĩªå·± çļĦ
åº ķ
èµĦ æºĲ
éĥ¨ éĹ¨
o ve
æ³ ¢
åŁº ç¡
ver s
æ ¿
åĪ° äºĨ
çº ª
ä¸į æĺ¯
æ¬ §
åŁºç¡ Ģ
çļĦ æĺ¯
åĮĹ äº¬
è® ²
ç« ŀ
åį ´
2 4
åıĳ çĶŁ
æĭ ħ
ri b
Ġa r
èĪ ¬
Ġnum ber
Ġin to
åį °
æī §
åľ° åĮº
202 2
ä½Ĩ æĺ¯
Ġst ud
ç¨ ³
åĳ ³
èģ ļ
ï¼ļ âĢľ
åĨ Ļ
æĹ¶ åĢĻ
ç ĵ
ä½ Ļ
ä» ĭ
å¹´ çļĦ
è¾ ĵ
èĥ½ å¤Ł
æĤ ¨
r ight
p h
ä½ľ çĶ¨
ä¸į æĸŃ
æĪ ı
è Ĵ
sq rt
çĸ «
åĨħ å®¹
Ġ- >
çķ Ļ
å¹³ åı°
é¡ µ
æ¬ ¢
ä¸Ģ å®ļ
å° ¼
ç» §
ç¬¬ äºĮ
æ¯Ķ èµĽ
æīĢ æľī
Ġt w
$ .
Ġe qu
i o
oc k
åı ¦
æ¿ Ģ
ç½ĳ ç»ľ
å®Į æĪĲ
Ġth an
Ġus e
er m
æ ¦
èĪ ª
åī Ĥ
åŃ ©
é ²
äº ĳ
å¥ ¥
è¯ »
åº Ĺ
çĶ³ è¯·
Ġne ed
202 1
le ct
Ġwhe n
æ ¤
å® ³
çī Ľ
åĨ ł
Ċ ĉĉ
r or
ã Ĥ
r ap
im es
= =
çı Ń
åĲ ¸
l l
åī ¯
ĠTh is
æ ĵ
o ol
åĸ ľ
ä¸ ´
çł ´
çİ° åľ¨
re at
3 2
äºĨ è§£
ç» ¼
è¡ ¥
Ġex p
Ġb ec
åĬŁ èĥ½
è®¡ åĪĴ
æ±½ è½¦
åħ¨ çĲĥ
å Ĥ
çĶ± äºİ
Ġim port
æľī åħ³
Ġp os
éļ ľ
is h
Ġp e
è´ §
æ¹ ĸ
pt ion
äº «
å² ģ
æĿ İ
Ġt ime
Ġc ol
Ċ ĊĠĠĠĠĠĠĠĠ
8 0
æ ½
çª ģ
ang e
éħ ¸
çľ ¼
if ic
ht t
åħ Ń
ret urn
Ġab out
æĽ ¾
p ar
Ġn ew
åĵģ çīĮ
çķ ¥
ï¼ī ï¼Į
çĹ ĩ
ĠC h
ç Ĩ
åº §
çĻ »
éĢ ģ
c he
éĴ Ł
å® £
o ok
å®¢ æĪ·
re n
ver y
å¸ ®
æ± ¡
äº ²
Ġk n
it s
Ġ 6
p r
ter n
Ġcon s
åĬ ³
ç ¿
l es
æĭ ¥
4 0
ĠI t
éĥ½ æĺ¯
i an
å® ĺ
ä¸ļ åĬ¡
r it
åıĳ çİ°
st em
on s
åĮ» éĻ¢
æ´ ²
r am
åĽ½ åĨħ
Ġf ind
Ġwor k
ä¹ ¡
ä¼ ¤
n ing
Ġthe se
Ġwh o
åİĨ åı²
åº ı
ç» ¿
ke y
å¾ ģ
è®¤ ä¸º
% ï¼Į
Ċ ĠĠ
éľĢ æ±Ĥ
Ġg et
è¿Ļ ç§į
é» ĳ
r ic
å· ®
ç £
èĥ ľ
æĪĳ åĽ½
Ġd iff
ot h
æĹ ı
çĶµ åŃĲ
åĩ »
åĪ¶ éĢł
Ġthe re
æĶ¿ çŃĸ
ä¿Ŀ æĬ¤
æŀ Ĳ
f rom
Ġb et
Ġ `
ç« ł
iv en
æ¶ ²
éķ ĩ
T h
æİ§ åĪ¶
od el
ç» ©
is s
æį ¢
ç²¾ ç¥ŀ
Ġfor m
å¼ Ĥ
Ġl i
ç« ¯
è½ ½
1 00
æľª æĿ¥
åį ĥ
èīº æľ¯
è½ ®
å¢ŀ åĬł
% ãĢĤ
èĭ ı
çĸ ¾
ä¹ĭ åĲİ
ä¸į èĥ½
é¦ Ĩ
çĶ ·
ä»£ è¡¨
en er
åĲ ĥ
æıĲ åįĩ
Ġ âĢ
Ġ1 0
ç»ĵ æŀĦ
ar k
å° Ħ
Ġm ay
Ġh is
é¢ ĳ
ug h
Ġit s
Ġh ow
Ġf irst
Ġs et
Ġa cc
c k
èĻ ½
ä¹ĭ ä¸Ģ
å± Ĭ
Ġtw o
Ġy ear
Ġa ct
ç ĩ
a w
ä¸ °
e f
æľ ¨
æĻº èĥ½
èĩª çĦ¶
Ġs up
ç»ı èĲ¥
x ed
Ġo b
o v
æĶ¯ æĮģ
a use
ç»¼ åĲĪ
c ess
ä» ¤
è¿ĺ æĺ¯
å¼Ģ å±ķ
ä¸į ä¼ļ
ç§ Ģ
Ġad d
Ġp r
å ©
Ġa g
éĿ ©
ä¸Ģ æŃ¥
al ly
i ed
rac t
op le
æĬ Ĺ
c re
ol og
ä¸Ģ èĪ¬
i el
l og
æĴ Ń
å¥ ĩ
èĳ Ĺ
åĨ ·
æİ Ī
ec h
åĲ ¦
20 20
ä» į
Ġthe m
Ġs ome
å¸Į æľĽ
Ġan y
ï¼Į âĢľ
Ġ |
è§£ åĨ³
å¾ ħ
ç§¯ æŀģ
2 3
Ġp re
å® Ŀ
9 0
åıĳ å¸ĥ
æĸ° çļĦ
in ce
Ġo ver
åĪ© çĶ¨
ä¿ ĥ
èģĮ ä¸ļ
è´Ł è´£
ç§ »
ar s
è¿Ļ ä¸Ģ
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ä¸º äºĨ
è¿ °
at ch
æ°´ å¹³
æĮģ ç»Ń
ä¸Ĭ æµ·
çŁ Ń
ar i
n g
é ¸
Ġs uch
ç´ ¢
v al
æī ¾
çŁ¥ è¯Ĩ
æĭ¥ æľī
è½ ¯
æ¯Ķ è¾ĥ
Ġs ol
Ġe ach
f ig
ib le
é£ ŀ
c d
( '
Ġ Y
ç» Ŀ
b le
æķĻ åŃ¦
ä¸Ĭ çļĦ
ap p
Ġin d
ir c
S t
Ġd es
éĶĢ åĶ®
t est
ang le
ä¸ĩ åħĥ
åĪĨ æŀĲ
çĶ¨ äºİ
`` `
æį Ł
ic k
9 9
è Ĺ
2 2
Ġn o
å¿ħ é¡»
ç¥ ¨
u ct
âĢĶ âĢĶ
Ġbe en
åħ ¸
æĽ´ å¤ļ
Ġ 201
Ġre g
---- ----
is e
" )
ç¬¬ ä¸ī
č Ċ
æī ĺ
\ )
Ġre l
çĶ¨ æĪ·
æ¶Ī è´¹
ou g
äº§ çĶŁ
åĩ Ģ
Ġun der
Ġf un
åĲĦ ç§į
ut ion
i ew
( &
en c
åĲ ¬
d s
ä¹ °
è¡Į æĶ¿
è¿ĺ æľī
å®ŀ æĸ½
Ġs ub
å ³
ä»Ĭ å¹´
æĦ ¿
Ġ 7
éĩĩ çĶ¨
å ª
æĿ¡ ä»¶
s h
Ġd ata
n e
Ġp oint
çĶ ²
å¦Ĥ ä½ķ
ä¼ł ç»Ł
è¾¾ åĪ°
in k
Ġas s
åĽ º
æŁ Ĳ
è´£ ä»»
æľī æķĪ
åħ «
åıĤ åĬł
t ype
ig h
åħ³ ç³»
Ġe m
é Ĩ
ä»· æł¼
s s
u es
// /
æł ĳ
p os
åŃ© åŃĲ
äºĨ ä¸Ģ
éļı çĿĢ
èĢĮ ä¸Ķ
d ata
åģ ľ
2 6
ment s
èģĶ ç½ĳ
è¿Ļ æĺ¯
å¯¼ èĩ´
it ies
Ġ 8
htt ps
çĽ® æłĩ
ul ar
vel op
ut e
re ad
è¯ ī
Ġsp ec
è Ĩ
at ive
åŁº æľ¬
è¶ħ è¿ĩ
ro ugh
ç» ĥ
at ing
il ity
Ġpe ople
èĥ½ æºĲ
ä½ Ľ
åĪ »
æĶ »
ç³» åĪĹ
éĤ£ ä¹Ī
Ġus ed
æ¢ °
f ter
å¯ Ł
é¥ ®
Ġin ter
2 7
åıĸ å¾Ĺ
" :
ç´ §
åħ³ äºİ
åº ĵ
"" "
ic s
Ġon ly
Ġa m
Ġt est
åĵ ª
éĢ Ĳ
çŁ¥ éģĵ
Ġpro du
Ġre m
ç¼ º
Ġin cl
çĮ ®
æ¯ Ĵ
en g
æ¯ ķ
å¸® åĬ©
he d
åŃĺ åľ¨
2 8
æ³¨ æĦı
æĿ ¯
C on
æ¯ į
èĻ½ çĦ¶
Ġf e
åıĤ ä¸İ
Ġw ould
Ġm ost
éĩį çĤ¹
æĸ¹ æ¡Ī
çĶŁ çī©
äº Ī
æİ ¢
éģ ĩ
Ġo ur
æ¥ ¼
æĿ¥ çļĦ
å½¢ æĪĲ
è¿ ½
ĊĠĠĠĠ Ġ
= "
éĩĳ èŀį
éĢ ı
è¿Ľ åħ¥
è¿ İ
ad e
ä» ĺ
åª Ĵ
æ± ī
æ¸¸ æĪı
t he
ä»» ä½ķ
Ġman y
çī¹ åĪ«
çĸ¾ çĹħ
Ġv alue
ation al
é¡µ ç¬¬
ä½ ³
æĽ ²
Ġs im
ä» ª
åº Ń
æī ©
å¤ «
èį ī
ä¸į ä»ħ
ç» į
bo xed
ä¸Ģ èµ·
æ¤ į
ass ert
cd ot
æĪĲ åĬŁ
çŃ ¾
åĨ Į
æĬ¥ åĳĬ
åĪĨ éĴŁ
è§Ħ åĪĴ
Ġh ad
èį £
åģ ĩ
æŃ ¦
6 4
ä¹ĭ éĹ´
201 9
ä»¥ ä¸ĭ
or k
ä»· åĢ¼
æŃ »
é ¼
Ġdiff ere
s c
çİ° ä»£
èĭ ¥
çĽ ĸ
âĢ ¦
å¾Ĺ åĪ°
æĿ¥ è¯´
è¡ Ĺ
æĶ¶ åħ¥
Ġre c
æ° §
çłĶ åıĳ
i x
äºº æīį
ar ch
ç»§ ç»Ń
å® ģ
2 1
Ġpro v
äºº ä»¬
ro und
å½ ©
è¿Ľ ä¸ĢæŃ¥
al th
çĶ ļ
åı ¶
s et
æŃ Į
å¤ ı
ä»ĸ çļĦ
v ent
åŁº éĩĳ
Ġth rough
ä¸ ĥ
åľ° æĸ¹
in al
v alue
Ġch ild
ä½ľ åĵģ
åºĶ è¯¥
l ine
ä¼ ¼
Ġre qu
Ġd i
æĹ¥ æľ¬
å§Ķ åĳĺ
æĹħ æ¸¸
Ġwhe re
ff ect
ï¼ī ãĢĤ
ä¼ļ è®®
éĺ ¶
çĽ´ æİ¥
è§Ħ æ¨¡
åĽ °
è®¸ å¤ļ
Ġwh at
Ġ /
we en
ĠU n
è ĵ
æĻ ļ
O N
æĪĲ ç«ĭ
çģ µ
} \
} ,
n ew
å®ŀ éĻħ
ag es
çł ģ
æĮ ¥
Ġde f
å® Ī
ä½ĵ ç³»
u c
åĳ ¢
å¥ Ĺ
Ġhe l
éĽ ¶
eth od
Ġd ec
p on
éĻ Ħ
3 5
Ġb u
Ġs ec
è¿Ĳ åĬ¨
åĨ ²
Ġthe n
æĽ´ åĬł
äº¤ éĢļ
å· ¦
åĲ ¯
èĮĥ åĽ´
m er
u res
æ¶ ¦
ä¹ ħ
Ġt e
ä¸Ģ çĽ´
åĪ ¤
æıĲ åĩº
æĺ¾ ç¤º
æĪĳä»¬ çļĦ
æľŁ éĹ´
ä¿Ŀ æĮģ
p ect
æ¨¡ å¼ı
å» ¶
è¯ ¢
è Ľ
æ³ Ľ
Ġd ist
è® ¯
åı ³
ç»ĵ åĲĪ
ä»ĭ ç»į
Ġf ol
å»º ç«ĭ
é º
é¡ º
çĶµ å½±
æĵ į
é£Ł åĵģ
in s
f ul
## ##
éĢł æĪĲ
y p
Ġv al
{ \
æĿ Ĥ
éĵ ¾
åħ¨ éĿ¢
' :
if y
ä¹ Ŀ
è· Ł
éĶ Ļ
id ent
ç² ī
æľº æ¢°
è® ¢
æĮī çħ§
æľĢ åĲİ
or m
t e
Ġbet ween
éĻ Ī
Ġ 9
åĽ¢ éĺŁ
Ġat t
Ġp ar
åĬ ª
ç½ĳ ç«Ļ
è®¡ ç®Ĺ
ro up
al s
å¨ ģ
ist s
åºĶ å½ĵ
è´ µ
m ut
è¡Į ä¸º
å ĺ
le ft
éĽ ¨
èı ľ
Ġtr ans
çļĦ æĹ¶åĢĻ
p ath
am ple
Ġo p
éĴ Ī
] ,
æĹ¶ ä»£
çļĦ åıĳå±ķ
è Ń
# [
åĤ ¨
åį ±
åĬł å¼º
éĢ Ģ
é¥ °
ç»ĵ æŀľ
7 0
åħ¬ å¼Ģ
Ġsy stem
åİŁ åĽł
èĥ Į
èĢ Ĳ
pl ic
å®¹ æĺĵ
he n
é Ń
ä¼ĺ åĬ¿
ç« ¥
at ure
æĭ ¿
æ³ķ å¾ĭ
ub l
ç»ı éªĮ
åº Ł
å¸ Ń
in es
æ£ ®
Ġ i
Ġp h
åľ £
ĠP ro
ç¬ ¦
Ġb l
Ġs m
2 9
an n
æİ¨ åĬ¨
ow er
al c
Ġres ult
æİ ª
å¹ ħ
éģ ¿
as ed
åĪĨ åĪ«
ref ore
æķĪ æŀľ
Ġs a
Ġde velop
æĢ ¥
s er
è° Ī
åº Ĩ
éĵ¶ è¡Į
åħ± åĲĮ
ur ing
æķ £
åĿ Ĺ
éĿ¢ ç§¯
æĢ İ
ä¹ İ
t en
f ile
éģ Ĺ
æĿ ¾
ä¸ĵ å®¶
201 8
èĥ ŀ
åĲĮ æ¯Ķ
èŃ ¦
è¯ Ĺ
ä»¥ æĿ¥
Ġli ke
èĦ ĳ
t t
æĢ§ çļĦ
çĿ £
æ° ¸
çĶļ èĩ³
ç©º éĹ´
ç¯ ®
åĩı å°ĳ
Ġf n
çļĦ å¤§
èº« ä½ĵ
è¿ĩç¨ĭ ä¸Ń
æ´ Ĺ
äº¤ æĺĵ
ç ĳ
Ġsh ould
ç¨³ å®ļ
çĪ ¶
éĽ ·
åŁ¹ åħ»
åĨ³ å®ļ
t al
åĬª åĬĽ
ç¾İ åħĥ
éĿ ł
E r
our ce
é ½
ä¿Ŀ éļľ
è° ¢
èĤ ¤
å¤ ®
Ġ @
èĹ ı
ä¸¤ ä¸ª
çĨ Ł
è ĸ
é¢Ĩ å¯¼
åº Ĭ
åıª æľī
åĮ» çĸĹ
èĩª åĬ¨
Ġd et
a ult
è® ¿
t ing
ä¸ ½
4 5
ic es
å¡ ĳ
æ£Ģ æµĭ
ä¸Ģ ç§į
æĹł æ³ķ
Ġc re
ce pt
éĹ »
çİ ©
Ġc o
åĪ ĺ
è¡¨ çİ°
E R
Ġof f
at or
Ġ 200
æ² Ļ
èĦ ±
I N
æ ¾
æķĻ å¸Ī
Ġa c
åĢ Ł
éĶ ®
ĠC on
et s
åŁ¹ è®Ń
ç¬ Ķ
ire ct
ä½ĵ èĤ²
ä¿ĥ è¿Ľ
n ce
Ġm ake
åĪ ļ
æī§ è¡Į
Ġm in
ĠN one
' )
Ġ= >
å¸ ģ
i ous
() ;
çĲĥ éĺŁ
ä¸į è¿ĩ
Ġn ame
å° ¤
Ġ >
ç»ı è¿ĩ
} }
Ġp ol
h at
Ġin f
ect ion
as h
e qu
ĊĊ Ċ
åĳĺ å·¥
å¹´ æĿ¥
ä¸¥ éĩį
f n
å½ Ĵ
è´ ¸
æ¡ ¥
æĢ§ èĥ½
er n
Ġc or
é¡ ¾
iel d
åıĺ åĮĸ
ãĢĭ ï¼Į
çŁ ¿
ç«ŀ äºī
t imes
æĺ¯ä¸Ģ ç§į
å² Ľ
ĠâĢ ĵ
a z
éĴ ±
as es
åĵ Ī
ä¸° å¯Į
æĳ Ħ
é¡ ¶
Ġfol low
çĶ °
ĠW e
ar n
S T
æ³¨ åĨĮ
æ¸ Ĳ
ç»Ĩ èĥŀ
æ± ł
éŁ³ ä¹Ĳ
å¡ Ķ
Ġkn ow
è¯ Ĭ
åħ· ä½ĵ
¤ Ĳ
äº ®
æľ ĭ
æĭ į
ĠH e
} )
è¯¾ ç¨ĭ
åıĹ åĪ°
Ġ= =
å® Ĺ
è¿ Ŀ
å¹¿ æ³Ľ
åĨľ ä¸ļ
èµĽ åŃ£
ĠI f
å®ŀ éªĮ
y n
ĊĠĠĠĠ ĠĠ
æ¶ ī
æħ ¢
form ation
åİ ħ
å¹¶ ä¸Ķ
Ġb oth
æĽ ¼
åĿļ æĮģ
[ '
æŀ ¶
ä¼ĺ ç§Ģ
åĬ³ åĬ¨
äº¤ æµģ
Ã ©
ç¤ ¼
çĶŁ æĢģ
re nt
() ,
æĪĲ æľ¬
w n
t y
åıĬ æĹ¶
oug h
ere d
åĬł å·¥
è¯ º
æİ¥ åıĹ
è®¾ æĸ½
Ġp ers
! (
éľ ²
æĪĺ çķ¥
Ġpro ble
è· Ŀ
Ġ1 8
ä¸Ģ æł·
Ġc ent
æĪĳ çļĦ
s on
èĻ ĳ
äºĭ ä¸ļ
Ġl ist
Ġ 20
è® ¨
Ġst ate
ä¸Ģ æ¬¡
è¯ ļ
ç¢ ³
æİ¨ è¿Ľ
Ġus ing
é¦Ļ æ¸¯
æł¸ å¿ĥ
if e
Ġin st
å· ¨
èĤ ī
ol d
3 3
o y
éĻ¤ äºĨ
an c
g an
èģĶ åĲĪ
çĻ £
çĽ Ł
id es
Ġg iven
æķħ äºĭ
æķ° åŃĹ
Ġw ater
ant s
< /
å· Ŀ
è ¸
Ġg r
s p
åį« çĶŁ
Ġf l
Ġfun ction
çĩ ĥ
con t
Ġhel p
æĸ½ å·¥
Ġs ur
æķ ĳ
al ity
e ver
å¿« éĢŁ
Ġin v
æĺ¯ åĲ¦
è§ ¦
ç´ ¯
èµĦ éĩĳ
è¯ į
èı Į
çīĽ çļ®
e v
éĺ¶ æ®µ
i ence
l ed
æ³ °
æŃ£ åľ¨
ç ¦ģ
u de
res ent
çĤ İ
çĽ ĺ
çļĦ é«ĺ
é ¹
æ¢ ¦
ad d
201 7
ut h
æ£Ģ æŁ¥
er g
ä½į äºİ
åĪ ¸
al se
åįı ä¼ļ
ot her
ä¼ ĳ
éĩ Ĭ
ä¸ Ŀ
iv es
æĶ¹ éĿ©
åĪ¶ åº¦
è ª
a ir
è· µ
Ġc all
çİ° åľº
æľĭ åıĭ
Ġj it
Ġ her
åĲ Ĺ
Ġyear s
oc i
å° ļ
r ite
w w
alc ul
èĻ ļ
é ¤Ĳ
r on
çīĽçļ® çĻ£
åĽł ç´ł
å° ģ
$ $
éĿ Ļ
Ġm ust
çĲĥ åĳĺ
Ġg o
åĮĸ åŃ¦
æ¯ķ ä¸ļ
åĮº åŁŁ
3 6
åĲĪ åĲĮ
Ġc he
åªĴ ä½ĵ
åıĳå±ķ çļĦ
od y
å¹´ åº¦
Ġc ount
Ġ ed
Ġg ener
c ent
éŁ ©
çľĭ åĪ°
åİ ļ
çļ® èĤ¤
èĢĥ è¯ķ
ĠC om
æĪĲ ç»©
ä¼ °
c ol
' ]
æľº åħ³
Ġa fter
e ad
æĿ¥ èĩª
æ±¡ æŁĵ
b ers
æĺ¯ åľ¨
Er ror
åħ³ æ³¨
Ġto tal
Th is
ĠF or
il y
çĸ ĳ
Ġbec ause
æ¦ Ĥ
iz ed
æĪ ª
el se
Ġs ame
èĭ ¦
Ġr ight
ä¼ ¦
Ġ z
b y
ech n
å±ŀ äºİ
ä¸į è¦ģ
ç¡ ¬
Ġw ell
å¡ ŀ
æĵį ä½ľ
è¶ £
p i
b r
00 00
Ġh igh
æīį èĥ½
å½¢ å¼ı
ä¸ĭ éĻį
ç Ĵ
ï¼ī ãĢģ
å®¶ åºŃ
re qu
äºĴ èģĶç½ĳ
Ġs k
èĥ ¶
æľº ä¼ļ
è ľ
Ġdiffere nt
éĻ Ĩ
æľī çļĦ
æĺ ł
ur al
Ġ #
Ġpro cess
èģ ĺ
åħ¬ åħ±
çŃ Ķ
å¯ »
å¤ ľ
}$ .
Ġl arg
d d
åł Ĥ
æ· ·
m in
Ġdo es
çĽ Ľ
æ´ ģ
Ġre f
Ġin cre
åķĨ ä¸ļ
ow s
3 1
ul l
å§Ķåĳĺ ä¼ļ
ä¿Ŀ è¯ģ
æĥ ł
æĢ Ģ
ur rent
s l
æİª æĸ½
è¾ Ĩ
è¿Ļ éĩĮ
eng th
Ġf ound
201 6
åĨ ¬
ä¸Ń åįİ
åį Ī
è®° èĢħ
åħ¶ å®ŀ
f un
åĲ ī
åı ¥
å³ °
å»º è®®
æŃ£ å¼ı
Ġc ould
ä¼ ´
çī© è´¨
f e
çĹ Ľ
æ± ĩ
Ġs he
åĪ¶ ä½ľ
à ½
èĪ ¹
è°ĥ æķ´
() .
è Ķ
Ġ end
ä¸į åı¯
åĬ ±
æļ ĸ
èµ· æĿ¥
æŃ¤ å¤ĸ
** :
R E
çī Ļ
Ġb r
éª ¨
é£İ éĻ©
Ġs ign
ç®Ģ åįķ
é² ľ
è§ Ī
Ġs u
äº ¦
åħ³ éĶ®
Ġ ent
åĲ ¨
è¿Ĳ è¡Į
æĺ¯ ä¸Ģä¸ª
al e
ir on
çļĦ æĸ°
i er
çĥ Ī
Ġv ari
æ¹ ¾
ç¯ ĩ
Ġf act
t s
p end
Ġev en
æĮĩ å¯¼
ä¹ĭ åīį
éķ¿ æľŁ
åĩº äºĨ
g ram
ain s
im pl
Ġre ad
it ions
ual ly
èµĦ æĸĻ
Ġm od
Ġse e
æĸĩ ä»¶
çĸ« æĥħ
Ġp at
çİ¯ ä¿Ŀ
s w
Ġcl ass
æ´ ¾
Ġm ed
çĥ Ł
éĩı çļĦ
Ġl oc
.. .
ch ool
å® ľ
ç§ Ł
çģ ¯
Ġt ri
æ»¡ è¶³
è¿Ĳ èĲ¥
it ed
åĪ º
ical ly
èĲ ¨
å² Ĺ
m a
æĹ ¢
7 5
æĭ Ł
æľ «
w ard
ç¼ ©
çº ¸
Ġstud ents
æĸ Ĺ
éĻį ä½İ
å¸¦ æĿ¥
ç® ±
Ġhe alth
æĿ Ģ
ç¡® å®ļ
å®Į åħ¨
æľĢ ç»Ī
A C
ç¬¦ åĲĪ
ä¸į å¾Ĺ
cl ass
åĪĽ éĢł
è¿ ª
åıĳ æĮ¥
ç§ ģ
åİĭ åĬĽ
æĸ¹ åĲĳ
è´ ¥
è ļ
olog y
èµĦ æł¼
ç¨ĭ åºı
èĪ ŀ
çĶŁ åĳ½
ä½ł çļĦ
å°ı æĹ¶
an y
pr int
ä¸¾ åĬŀ
éģ¿ åħį
æĢĿ æĥ³
is m
Ġincl ud
åľ Ĩ
éĽ Ħ
± ä¹Ĳ
Ġpos s
èĦ ļ
8 8
ä»» åĬ¡
Ġex per
Ġre t
ä¸Ń å¤®
id er
åģļ å¥½
ä¸įåĲĮ çļĦ
æ» ĳ
as k
åĸľ æ¬¢
ä¹Ł æľī
æľ Ŀ
Ġt ype
Ġequ ation
æ´ Ľ
ç½ ļ
Ġb el
çĦ¶ åĲİ
åħĪ è¿Ľ
ãĢģ âĢľ
éļ Ķ
ak ing
Ġm ethod
åħħ åĪĨ
æķĻ æİĪ
çĬ¶ æĢģ
ĠR es
è· ¨
æĮ ĳ
Ġe very
um ent
ä¸» é¢ĺ
ot s
å ´
ä»Ĭ å¤©
èİ ±
çī¹ èī²
èµĦ äº§
Ġst art
éĢ Ķ
é«ĺ çļĦ
Ġl ine
å¹ ¸
è¶Ĭ æĿ¥
Ġle t
s in
çĲĨ è®º
Ġl ong
å·¥ èīº
Ġs er
ä»İ èĢĮ
èĽ ĭ
èĦ Ĥ
M E
è¶ĬæĿ¥ è¶Ĭ
et y
æħ §
ain ing
èª ī
èĤ¡ ä»½
il es
åĳ Ī
æĿ Ł
å¹ ķ
åĴ ¨
ar m
3 4
Ċ ĉ
arg s
ç ĺ
çī© æµģ
å®ŀ è·µ
åĦ¿ ç«¥
Ġm on
èĨ ľ
æģ ©
Ġcon d
Ġdis c
ter s
è´ ¡
at ic
æĶ¹ åıĺ
ä»İ äºĭ
éĩįè¦ģ çļĦ
ãĢĤ âĢľ
19 9
å© ļ
Ġsec ond
è½¯ ä»¶
n ess
Ġbe ing
ç»Ħ æĪĲ
b in
æīĵ éĢł
è¿ĩ åİ»
åĲ §
ot e
éĩĳ å±ŀ
er y
è¿ ·
è¯ ¯
pon se
ĠT r
æĺİ æĺ¾
im port
3 8
çĶµ è§Ĩ
it er
æĢİ ä¹Ī
åĩº çļĦ
Ġb o
ĠA n
A S
äºº ç±»
æ´ ĭ
å± ĭ
éĩ İ
è¯Ń è¨Ģ
å¼Ģ æĶ¾
ç¨ĭ åº¦
Ġw ay
åĴ¨ è¯¢
åį ĸ
æ¡ £
ç»¿ èī²
èĢģ å¸Ī
çĽ® çļĦ
å± ĳ
d ate
and s
é ±
åĬŀ åħ¬
æĦı è§ģ
Ġm odel
ire d
os s
Ġre se
ç© ¿
Ġb ack
== ==
ç³ ĸ
çļĦ éĩįè¦ģ
Ġin formation
è§Ħ èĮĥ
æ¶ Ĥ
çĬ ¯
çļĦ äºĭ
é½ Ĳ
__ __
i k
ä¸Ĭ å¸Ĥ
Ġj ust
éĺ µ
Ġa v
c ri
å®£ ä¼ł
é± ¼
å®ī è£ħ
ä¼ Ĭ
å½ĵ åľ°
çļĦ å·¥ä½ľ
rap h
éĥ½ æľī
Ġsm all
ç½ ª
åŁº åľ°
çħ ¤
am es
è´ ´
å®Į åĸĦ
çļ ĩ
ĠH ow
çī¹ çĤ¹
Ġs um
æĳ ĺ
Ġ er
å§ Ĩ
åįģ åĪĨ
at t
çĵ ¦
Ġc ar
æĪĲ æŀľ
èģĶ ç³»
éĩį å¤§
ar row
ress ion
Ġe ffect
ä¹ Ļ
å¼ķ èµ·
ç½ ²
ç¼ ĵ
åĮĸ çļĦ
em ent
Ġs erv
v iew
## #
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
æ¯ Ľ
åĮ» åŃ¦
åĿ Ĳ
åı «
éĽ ª
åĨł åĨĽ
v iron
Ġchild ren
å°± ä¼ļ
r ay
A T
) $
e e
Ġ :
Ġ1 2
ä¸¾ è¡Į
èĢĥ èĻĳ
st it
èĲ½ å®ŀ
p y
he s
ç¡® ä¿Ŀ
201 5
en se
ubl ic
Ġwor ld
æĿ ¨
5 00
el s
t a
ĠS ome
4 8
if ied
c ed
ç¿ »
éĽ ħ
m e
æķ´ ä½ĵ
E x
å® ½
ä¸ª æľĪ
w are
pl es
æİ Į
3 7
at her
Ġa rt
ent ial
æ® Ĭ
6 6
æķ´ ä¸ª
æŃ£ å¸¸
é² ģ
Ġe ar
" .
Ġ u
( \
å¹³ æĸ¹
è¿Ĳ è¾ĵ
æĿ °
Ġex t
Ġv is
åŃ Ķ
çĻ» è®°
æĦı ä¹ī
å½ĵ æĹ¶
åĩº åı£
å¸ Ŀ
æĺİ ç¡®
: **
å¹¶ ä¸į
æĿ¥ çľĭ
æĻ® éĢļ
çĦ ¦
åĢ į
çĹĩ çĬ¶
æı ¡
č ĊĠĠĠĠ
èĵ Ŀ
è°ĥ æŁ¥
æº ¶
5 5
æīĭ æľº
æ¸© åº¦
èĢ ³
åĢ º
æī ¬
çļĦ æĥħåĨµ
Ġ .
å® «
i vers
lo ad
I D
æ¾ ³
çļĦ éĹ®é¢ĺ
mer ic
Ġc r
an k
Ġsup port
ç§ ĭ
R es
ä¾Ľ åºĶ
Ġre p
æģ ¶
å¿ĥ çĲĨ
Ġd iv
ç§ĳ çłĶ
Ġpers on
å°¤ åħ¶
éĺ »
åĨ °
ĠĠ Ċ
f ore
æ¢ ħ
æµ Ļ
å·¦ åı³
ç§ ĺ
at us
it ive
é¡ ¿
A R
èĳ £
Ġm y
åľ Ī
çĲĨ å¿µ
" ]
éĢļ çŁ¥
Ġm ain
çĥ §
åľ ³
Ġpart ic
L E
n er
Ġare a
T o
Ġg roup
Ġ\ ]
çİ »
èģĶ èµĽ
æ¶ ¨
æ·± åľ³
è¡Į åĬ¨
3 9
Ġ very
è´ ·
Ġm ut
ä½ĵ éªĮ
W e
åıª æĺ¯
Ġle ad
éĺ ħ
å¾ Ħ
çĦ¶ èĢĮ
ä¸» ä»»
Ġt echn
æµĭ è¯ķ
P ro
å¤ļ ä¸ª
Ġd own
Ġo wn
æ°§ åĮĸ
Ġcomm on
åĶ ±
æ°ĳ æĹı
b l
è´¡ çĮ®
é¾ Ħ
åħ· å¤ĩ
éĤ ®
ol v
ä¹ Į
è ¦
åĲİ çļĦ
c os
å±± ä¸ľ
ver t
Ã ¤
æ³ ¡
ĠA l
æ² ī
ĠA r
f o
. âĢĿ
åĿ ı
æĬ¥ åĲį
Ġm uch
æ¹ ¿
å®ĥ ä»¬
æ´ ¥
å¥ ĭ
è´ Ŀ
Ġint eg
é£Ł çī©
è° ·
Ġc irc
ç»Ł è®¡
m et
åĭ ĩ
ç»´ æĬ¤
ç»ı å¸¸
çĴ ĥ
ç¤¾ åĮº
åħ¬ éĩĮ
æľº åĻ¨
è£ ģ
ç¬ ĳ
æĮ ¯
ç©º æ°Ķ
åı¦ å¤ĸ
ak es
ab ility
Ġth ree
éĢŁ åº¦
åħ¬ å¸ĥ
Ġsa id
çģ ¾
åĲĪ çĲĨ
com m
Ġm et
çĪ Ĩ
ä¹ ĺ
èĴ Ļ
Ġh um
æ ĩ
Ġ }
æķĪ çİĩ
Ġf ile
ĠC l
éĴĪ å¯¹
çİ ī
Ġimport ant
Ġpro per
å¹¿ ä¸ľ
éĥ½ ä¼ļ
åĢ Ĵ
Ġp ass
éķ ľ
åĳ ¼
Ġap pro
æµ ĵ
èµ ¢
l ist
é¢Ĩ åħĪ
N A
ou se
Ġ\ ).
w ork
æĦı è¯Ĩ
he re
è¦ Ĩ
é¼ ĵ
S tr
. _
èī¯ å¥½çļĦ
lo b
åĪĽ ä¸ļ
å¹¿ å·ŀ
ri v
ä½ĵ çļĦ
èĢ Ĺ
åģ ı
è¶ ĭ
åĬĽ çļĦ
èĩª èº«
ĠThe y
Ġ %
çĳ ŀ
æĹ §
Ġt er
æĭ ĵ
å¤ º
ï¼ İ
çľŁ æŃ£
ä¸į å°ĳ
çİ» çĴĥ
ith ub
ĠE x
åķĨ åĵģ
åĩĨ å¤ĩ
æľ¬ æĸĩ
æľº åĪ¶
åĪ Ĭ
çº ·
m d
o f
çĽĳ çĿ£
çĲĨ è§£
Ġf am
p ly
åĵģ è´¨
T r
æĬ¥ éģĵ
å¦Ĥ æŃ¤
Ġm em
Ġ key
åĬŀ æ³ķ
éļ Ĳ
è´ ¯
m an
çĶŁ çļĦ
Ġ1 5
d ir
} }{
I T
4 4
æĮĩ åĩº
Ġth ose
i qu
Ġcomm un
è¡¨ éĿ¢
å½ »
æ·± åħ¥
éĵ Ŀ
viron ment
Ġproble m
æ½ ľ
è§Ĩ é¢ĳ
åıį åºĶ
ä¾ĭ å¦Ĥ
æĻº æħ§
ur s
æ¯Ķ å¦Ĥ
st and
åĬł åħ¥
æĬ ĵ
Ġs om
è¿Ļæł· çļĦ
æľī ä¸Ģ
e y
å¦ Ī
6 5
è´ «
æĤ ī
éĿ¢ å¯¹
ĠA meric
ç¼ ĺ
è¡ £
ï ½
o h
æ¬§ æ´²
åĪ© æ¶¦
çĻ Į
åı ¬
Ġbe fore
èĭ± åĽ½
è´¹ çĶ¨
ä¾ §
it t
ä»ĸä»¬ çļĦ
Ð ¾
n ot
èį¯ çī©
d oc
C om
A B
åħ¨ éĥ¨
a it
Ġle vel
èĤ ¥
Ġin s
å¼ ±
enc y
åĵ ¥
çº ¯
Ġprodu ct
æ¶Īè´¹ èĢħ
æ½ ®
å¾ ª
ä¸ĸ çºª
ä¿ Ħ
g ithub
æ² ¿
ä¸ ¹
è¾ ĳ
è¯ ¦
Ġc ap
g er
Ġl ife
l and
ä¸» ä¹ī
Ġd uring
é¦ĸ åħĪ
d ay
åįļ å£«
æµ ª
ä¼ Ł
h ip
C l
Ġ X
Ġl ess
Ġ _
è¡ ¡
o in
æĲ Ń
u le
æ² Ł
are d
æİĴ åĲį
Ġ Q
æĹł è®º
ĠA s
Ġd irect
æĸ ĳ
æ¬¢ è¿İ
åĭ Ĵ
m l
åĩ Ŀ
ç ¹
iz ation
è¿ŀ ç»Ń
re ct
w ith
ä¼ ¯
ä¼ Ļ
åĬĽ éĩı
å¤ļ ç§į
) ]
åĽ° éļ¾
æŃ¤ æ¬¡
over n
æĹ Ĺ
Ġ est
åİ» å¹´
åĪ¶ å®ļ
Ġs l
at s
ar ning
in put
str ing
Ġ- -
Ġn ow
. ,
le q
! [
ç¹ ģ
åĿ Ģ
n um
m od
c irc
8 5
ç¬¬ åĽĽ
ä¹Ł ä¸į
èĤ ł
åĬ¨ åĬĽ
Ġstr uct
Ġl ook
æķ ı
ou n
O R
ä¸ ģ
) ^
åĪĽ ä½ľ
çĶµ æ±ł
Ġ\ \
I S
Ġr un
Ġ ident
æĬĢ èĥ½
ag s
Ġs qu
æ¦ ľ
å¼ ĥ
éĢļ å¸¸
ç¾¤ ä¼Ĺ
éĵ¶ å±ĳ
èħ Ĳ
ĠS c
âĢĿ ãĢģâĢľ
æı ı
å¤ļ çļĦ
æĪĲ åĳĺ
t on
èİ «
åŃ¦ ç§ĳ
w rap
us er
éĵ¶å±ĳ çĹħ
éģ į
Ġf ood
åľŁ åľ°
é¢Ħ è®¡
å¤§ åĪ©
Ġpl an
m at
æ¤į çī©
ç£ ¨
us s
èĩª çĶ±
åĶ Ĳ
æĹ¥ å¸¸
b e
Ġbu ild
Ġm ade
æģ Ĵ
Ġex ample
ect ed
åŃ Ļ
ff ic
æĶ¹ åĸĦ
ä¹Ł ä¼ļ
å® ĩ
è¯ ĳ
a j
éĿĴ å¹´
çī¹ æ®Ĭ
æķ° éĩı
4 9
æģ ¢
Ġan sw
çļĦ æľĢ
r al
f l
æ¼ «
è¾ ħ
ro ss
æ¶ī åıĬ
Ġor ig
ä¸Ģ ä¸ĭ
éĢĤ åĲĪ
D E
Ġwh ile
æĶ¿ æ²»
| |
åĨħ çļĦ
å¢ Ļ
Ġ1 6
Ġs pe
åħ ¼
å¹³ åĿĩ
æµĻ æ±Ł
æ¶Ī æģ¯
Ġt yp
é© ¶
åŃ¦ æľ¯
Ġt ake
Ġ __
Ġ çļĦ
par am
é¢ ľ
Ġm ult
åĲ ´
t es
Ġ ke
åĨį æ¬¡
ä¸¥ æł¼
Ġob ject
201 4
ä¿Ŀ éĻ©
Ġg ood
åį ·
ç±» åŀĭ
ä¸º ä¸»
æľī äºĽ
æľ¬ æ¬¡
202 3
æ® ĭ
ç»Ł ä¸Ģ
s ize
è´¸ æĺĵ
è¯ģ æĺİ
Ġd ay
æĦŁ æŁĵ
å¢ ¨
æı ´
en ing
ro l
Ġo cc
Ġc ost
å¢ŀ å¼º
ç¬¬ åįģ
ion al
å®ī æİĴ
l ab
arg et
åĶ ¯
å¾· åĽ½
) ï¼Į
Ġg row
Ġr is
A N
æĸ° éĹ»
å¤§ åŀĭ
ç» ķ
ap e
ĊĊ ĠĠĠ
Ġs chool
çļĦ è¯Ŀ
4 7
Ġ$ (
ang u
éħĴ åºĹ
' t
ç»ı åİĨ
ç»ı çĲĨ
æĥ Ĭ
åĪĨ ä¸º
m ap
qu ad
æĽ ¿
rib ut
t ime
i or
Ġag ain
ç¥ ĸ
b u
æĬ ĺ
o id
è· ĳ
æĹ¶ æľŁ
å± ı
åıª è¦ģ
8 6
åĨ³ èµĽ
Ġpro ject
ç ŀ
éĽĨ ä¸Ń
}$ ,
éľ ĩ
ra w
ol s
Ġc le
Ġact iv
è§ī å¾Ĺ
è¯´ æĺİ
çĽ¸ å¯¹
ĠS p
æĪĲ éķ¿
å°± ä¸ļ
çª Ĺ
è®¤ è¯Ĩ
è®¤ è¯ģ
st ate
Ġp ower
() )
å±ķ å¼Ģ
æģ¢ å¤į
ç»ĵ æĿŁ
æ³ ¥
åĨľ æĿĳ
ph a
éĩĩ åıĸ
æĦŁ è§ī
Ġof ten
č ĊĠĠĠĠĠĠĠĠ
ä»į çĦ¶
ĠI nd
in it
è¯ģ åĪ¸
ç§° ä¸º
åĲĦ ç±»
om en
Ġw rit
æĬķ åħ¥
å¯ ¿
c ount
çŃ ¹
åĩº çīĪ
S E
ç² Ĵ
ä¸ĭ çļĦ
Ġd r
ro p
åĺ ī
Ġm at
ä¼ĺ è´¨
w ays
vers ion
Ġt em
æ¯ı ä¸ª
w ord
ä¼ģä¸ļ çļĦ
C E
erg y
èĲ¥ åħ»
Ġr ange
é«ĺ æł¡
g r
æĮĳ æĪĺ
ĠY ou
ä¸ľ è¥¿
åĬ¨ çī©
Ġposs ible
Ġval ues
Ġch ange
æİ ī
åº Ħ
n et
èĻ «
Ġpro gram
èµ ı
20 00
è¿ ħ
Ġar g
èĬĤ èĥ½
ac ter
Ġp op
is hed
b ug
âĢ ĺ
ä¹¦ è®°
åķĨ æłĩ
éĶ ħ
çļĦ å½±åĵį
å¤§ å¤ļ
Ġ et
é© ¾
èĤ ¯
å·¥ åħ·
ä½į ç½®
us h
m odel
-------- --------
Ġor gan
Ġpro t
form at
right arrow
__ (
æ¢ ģ
åİŁ åĪĻ
im um
çĽ Ĳ
Ġstud y
C O
çĽ¸ ä¿¡
r ation
æļ ´
å¦ ĩ
è´Ń ä¹°
å®ĥ çļĦ
ç« Ł
y stem
Ġnum bers
çĽ¸ å½ĵ
id ed
çļĦ å°ı
ä¾Ŀ æ³ķ
" >
åĪ ·
éĶ ĭ
æľ Ĺ
Ġex pl
re g
æī¿ æĭħ
Ġh ist
Ġ ì
çĶµ è¯Ŀ
åħ¬åı¸ çļĦ
åıĮ æĸ¹
con fig
å½ĵ çĦ¶
l en
è´ ¦
åĩ Ń
Ġan al
Ã ¶
å¡ «
Ġqu est
it al
e q
åĵª äºĽ
å¹´ è½»
ï¼Į ãĢĬ
æ±Ł èĭı
ind ex
å°Ĩ åľ¨
Ġa round
æľī æīĢ
Ġe le
éĹ Ń
F or
åĮĸ å·¥
C h
un wrap
us ion
Ġn on
re am
ä¸ĸçķĮ æĿ¯
å±ķ ç¤º
Ġc alcul
åĬł å¿«
A P
f il
æĳĺ è¦ģ
äº ¡
æł· çļĦ
æľī æľº
åįĩ çº§
Ġre port
Ġg re
åħ¬ åĳĬ
ãĢģ ãĢĬ
å «
s erv
9 5
ere st
Ġl ength
éĢĲ æ¸Ĳ
è¿Ľè¡Į äºĨ
åĩ ¡
è¿ Ķ
l oc
Ċĉĉ ĉ
è± ª
oc ial
å²Ĺ ä½į
è´¢ æĶ¿
Ġpl ay
Ġg u
Ġh and
éĢ Ĵ
are nt
æİ¨ å¹¿
çªģ çł´
u x
a h
æ´ ŀ
Ġl og
ä¸Ģ å¹´
Ġ ec
èĳ£ äºĭ
åŃ£ åº¦
å·¥ä½ľ çļĦ
å¹³æĸ¹ ç±³
æĳ ©
è° ĵ
y m
é¸ ¡
iv ely
âĢ ĵ
æ³ķ éĻ¢
The refore
Ġ3 0
æ ©
6 7
èŀį åĲĪ
ĠN ew
æĬ ¢
ç¥ Ŀ
D ata
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
æķ ¬
ess age
æĸĩ æĺİ
åĲĮ åŃ¦
æĸ¹ ä¾¿
è·Ŀ ç¦»
åĪĨ åŃĲ
l i
è± Ĩ
a us
= '
æĶ¯ ä»ĺ
åħ¬ è·¯
æľĢ é«ĺ
ĠS elf
ç§» åĬ¨
é«ĺ éĢŁ
éģĵ è·¯
Ġwith in
in ed
Ġl o
Ġc urrent
our ces
èĭ Ĺ
å¤§ ä¼ļ
æĸ¹éĿ¢ çļĦ
çĽ¸ æ¯Ķ
å¤§ éĩı
éĥ ĳ
å° Ĭ
Ġwith out
è¯Ħ ä¼°
åŀ ĥ
è¿ ¹
åľ ¾
ä» ģ
m ed
åŀĥ åľ¾
Ġret urn
äº§åĵģ çļĦ
ri es
èµĦ æľ¬
è½ ´
äº¿ ç¾İåħĥ
è¯ ¸
å¹¿ åĳĬ
Ġhe ad
åĩº æĿ¥
is ion
Ġsy m
åı¯èĥ½ ä¼ļ
æ· »
ord ing
å¤į æĿĤ
ain ed
Ġdes ign
äºĮ åįģ
æ° ı
on om
éŁ© åĽ½
é© ±
éĺ ´
æĥ³ è¦ģ
Ġbe h
åįı è®®
éĩį è§Ĩ
ol ution
å¯ Ĵ
èĥ ĥ
am ples
æ¥ ļ
æļ Ĥ
Ġch ang
am p
w ay
] )
ç¢ į
å¿ħ è¦ģ
le x
che s
åı¦ ä¸Ģ
æĬ ½
Ġre al
i um
str uct
Ġsh ow
ere nce
Ġo per
éģ Ń
ä¸º ä»Ģä¹Ī
f ace
Ġansw er
èĢħ çļĦ
o le
ater ial
ul ation
åľ° äº§
æĬ µ
ãĢ Ĳ
å¿ ĺ
çĶ¨ çļĦ
Ġs ide
åĢ¼ å¾Ĺ
åıĬ åħ¶
åĩ ¯
Ġw ant
Ġc are
ple ment
èĴ Ĥ
over rightarrow
åħ¬ åĽŃ
Ġ\ ),
ivers ity
åľ¨ çº¿
f lo
Ġ es
Ġcomp let
ãĢ ĳ
â Ħ
ç¡ ķ
201 0
èĢĮ æĺ¯
Ġt reat
c ode
4 6
è®¡ç®Ĺ æľº
çİ° è±¡
Ġfollow ing
æ¯ı å¤©
ä¸» ç®¡
åıĳ è¡¨
} ;
I t
s ub
æī© å¤§
åĲ¸ å¼ķ
ex p
ate g
æ¯ «
äºº åı£
åħ µ
her s
èµ ŀ
ç» ª
é» ĺ
çĭ¬ ç«ĭ
é¥ Ń
im ate
çļĦ æĹ¶éĹ´
3 00
at ely
7 7
å±ħ æ°ĳ
æī ¶
Ġan g
0 1
å¤ª éĺ³
å¤Ħ äºİ
as on
ic ro
Ġb ody
uth or
åĪĨ äº«
cc ess
ä¹ ±
éĨ Ĵ
æ¯ı å¹´
è®¾ ç½®
ä¼ į
ï½ ŀ
id s
ä»¤ äºº
æ²³ åįĹ
éĤ Ģ
Ġkn own
çŁ¥ åĲį
åĲĦ åľ°
æ³ ī
å° ĺ
Ġc our
éº ¦
åģļ åĪ°
èĤ ¿
op y
k en
åħļ åĳĺ
èº« ä»½
b f
Ġre du
Ġrese arch
plic ation
ç£ ģ
æľĢ å¤§çļĦ
æĹ ¦
æĥ ¯
ä¸ī ä¸ª
äºº å£«
åĸ Ŀ
è° ģ
åľº æ¯ĶèµĽ
ä¸ĵ åĪ©
ä¾ µ
èĽĭ çĻ½
ĠT o
ä¸į åĪ°
al pha
å¹¿ å¤§
éĩį æĸ°
ä¹Ł åı¯ä»¥
Ġe lect
çĽĳ æµĭ
Ġt erm
ä¹ĭéĹ´ çļĦ
æ¯Ķ ä¾ĭ
åģ ¿
Ġd on
et er
æŀĦ å»º
A n
éĤ£ äºĽ
i od
Ġle ft
Ġ1 00
æ³ķ åĽ½
Ġg overn
u ro
Ġim p
æĻ ¶
åŃ¦ ä¼ļ
Ġd em
ç² ®
Ġh tt
Ġd id
æī¾ åĪ°
çı į
åĿ Ľ
æ³ ½
è¶ĭ åĬ¿
Ġcont in
Ġen vironment
Ġpoint s
è¯ģ ä¹¦
è§Ĥ ä¼Ĺ
res ult
åĨħ éĥ¨
¡ èĲ
Ġin it
æŁ ±
éļ Ĩ
> ,
æľĪ ä»½
çļĦ æĸ¹å¼ı
éĢĤ åºĶ
äºĭ ä»¶
Ġc ell
è¯Ħ ä»·
æľ¬ ç§ĳ
Ġ Ð
iv id
åĪ ĳ
act ion
åĬŀ çĲĨ
ãĢĭ ï¼Ī
Ġh im
é«ĺ åº¦
é¢Ħ éĺ²
Ġinclud ing
èĪª ç©º
I f
èį Ĳ
em s
æ± ¤
æľī çĿĢ
åĿ ¡
ä¸ĭ æĿ¥
è¦Ĩ çĽĸ
Ġcall ed
å± ¥
Ġcre ate
Ġcon st
Ġunder stand
ä¸´ åºĬ
é ī
éī ´
è®¤ çľŁ
è¡¨ è¾¾
çº ¤
8 9
æĪª èĩ³
çĶµ åĬĽ
T ype
201 2
åŁ ĥ
æĢ ķ
è®° å½ķ
ä¿ Ĺ
{ (
l er
çĹħ æ¯Ĵ
åĲĮæ¯Ķ å¢ŀéķ¿
int o
åŁº äºİ
æĭ ľ
å®ŀéªĮ å®¤
ä¼ĺ åĮĸ
Ġe as
Ġd ig
å§ ĵ
o x
é¥® é£Ł
æ¶ µ
è¶³ çĲĥ
åıª èĥ½
201 3
å¦Ĥ ä»Ĭ
è®Ń ç»ĥ
çĽĳ ç®¡
çĶ ĺ
Ġlarg e
è¯ķ éªĮ
åħĪ çĶŁ
æĻ ĭ
äºĨ ä¸Ģä¸ª
äºº å·¥
Ġde v
å¿ Ĩ
è´· æ¬¾
Ġl ast
æĺ¯ ä»Ģä¹Ī
c er
è½¦ è¾Ĩ
çļĦ ä¸»è¦ģ
. "
æĭħ ä»»
åħį è´¹
ition al
å¸¸ è§ģ
Ġ Z
æĦ Ī
Ġh our
Ġp ublic
å¹ ¼
Ġdet erm
èĲ¥ ä¸ļ
åĮ» çĶŁ
æľĢ å¤§
Ġb re
æİ¢ ç´¢
-- -
Ġf r
âĦ ĥ
ail able
çĽ¸ åºĶ
T est
èĦ ī
pl ay
æĮ Ĥ
å¹´ ä»£
æľī äºº
m ax
èį ·
è¾ Ľ
ç®Ģ ç§°
çı ł
æİ¨ åĩº
åĮ» èį¯
um e
è¿ ģ
angu age
æĢ§ åĴĮ
Ġl ab
Ġb ook
çļĦ ä¼ģä¸ļ
[ "
1 000
å°½ ç®¡
ur l
çļĦ äº§åĵģ
as ter
v en
ĠP l
% ï¼Ľ
Ġam ount
å² ¸
å· §
Ġf our
Ġhum an
âĢ¦ âĢ¦
Ġm ax
çļĦ æ²»çĸĹ
N one
Ġme ans
ä½ı æĪ¿
ç½Ĺ æĸ¯
al k
ä½ľ èĢħ
Ġm ark
åħ» èĢģ
ug g
ĠA nd
æĭĽ æłĩ
æİ¥ è§¦
Ġg reat
åĽ½ åĬ¡
çĤ ¼
Ġp res
Ġp ot
A L
Ġpro f
âĢĿ âĢľ
or g
Ã ¡
è¿ŀ æİ¥
lo od
ial ly
Ġm ove
in a
m ath
çĥ ¯
8 7
é¦ĸ æ¬¡
å®ŀ åĬĽ
æĪĲ éĥ½
ä¹ĭ å¤ĸ
il ar
æ° ¨
p ass
Ġint erest
è° ±
çĤ ī
ä¿ ±ä¹Ĳ
Ġin c
4 2
çĿ ¡
Ġb as
r c
æľ¬æĸĩ æĳĺè¦ģ
èĪ Ĵ
åıĳ çĶµ
å® ĭ
ä¿±ä¹Ĳ éĥ¨
éº »
èĳĹ åĲį
Ġpl ace
è®º æĸĩ
Ġs ince
re m
æļ Ĺ
åĲĦ é¡¹
éĶ ¦
è®¾ ç«ĭ
éĩį åºĨ
Ð °
è´Łè´£ äºº
Ġo ld
å® ¾
p oint
éĢļ ä¿¡
çİ° å®ŀ
è¿ «
ä¸Ģå®ļ è¦ģ
Ġpro b
Ġis s
æľī äºĨ
æĹ ¨
Ġter ms
Ġcon n
æ³ķ è§Ħ
è¿Ľ åı£
åŃ¦ ä½į
ä»¥ åĲİ
A D
Ġp ath
n s
è· Į
ĠA p
æĹ¥ èµ·
ç§ Ĵ
åĳĬ è¯ī
ä¼ł æĴŃ
it le
æľº åľº
w rite
and ard
çļĦ çĶŁæ´»
g en
äººæ°ĳ æĶ¿åºľ
op t
, âĢĿ
æ±¡ æ°´
è¿ĳ æĹ¥
ä¸į è¶³
ä¸Ģ ä½ĵ
å®ĺ æĸ¹
pl oy
çŃī çŃī
åĽ½åĬ¡ éĻ¢
iv ed
é«ĺ æķĪ
å¼ ¹
æĿ Ĩ
fun c
å¾Ģ å¾Ģ
0 5
çĻ¾ åĪĨ
Ġor der
ç¤º èĮĥ
ĠW hat
æĸĩ ç«ł
æĿ¥ æºĲ
l ib
ãĥ ¼
æŃ£ ç¡®
äº« åıĹ
éģ µ
åķĨ åĬ¡
Ġr ad
ä¸Ĭ åįĩ
èĩª ä¸»
éĿ¢ ä¸´
è½ ¨
Ġl a
çĬ¶ åĨµ
ir d
åħĥ ç´ł
Ġst ill
Ġdevelop ment
æ¨ ª
å¥ ¶
ac he
è§£åĨ³ æĸ¹æ¡Ī
Ġen ergy
ĠThe re
Ġl ight
ĠB ut
ĠS h
U R
Ġto p
l ish
7 6
I P
çĭ¬ çī¹
èĢĥ çĶŁ
æī İ
A M
è®© äºº
çĹħ æĥħ
ac es
ä¹ ³
å§ĭ ç»Ī
å½¢ è±¡
Ġch o
5 6
ĠThe se
æľĢ ä½³
è¿ĳ å¹´æĿ¥
éĵ ľ
åĲ¯ åĬ¨
æ· ¡
æį ·
é«ĺ è´¨éĩı
å² ©
çī© çĲĨ
or ies
Ġtr ue
ç± į
ab les
æľ ±
é¡º åĪ©
èĩ´ åĬĽ
åľ¨ ä¸ŃåĽ½
ä¼ ı
Ġt imes
iss ion
èģĮ å·¥
ä¸» æĮģ
it her
E N
Ġ å¹´
åĩł ä¹İ
in c
äºļ æ´²
Ġm ight
åĴĮ åĽ½
Ġp resent
å° ¾
c le
Ġcor rect
æŀĦ æĪĲ
å¾ Ĳ
çļĦ åŁºç¡Ģ
å£ ģ
r ist
op e
ur y
ert ain
å¤© çĦ¶
L et
in ess
æİĴ æĶ¾
å£ ®
id d
i ents
Ġdis e
Ġle arning
ç¼ ´
ut il
æĺ¯ æĮĩ
e k
æī¹ åĩĨ
ä¾Ŀ æį®
Ġl im
åĳĪ çİ°
Ġme as
æĭ Ĵ
çº ½
äº ķ
ç´ «
å®ļ çļĦ
a f
Str ing
äºĭ å®ŀ
Ġg en
Ġb en
Ġp ract
çľŁ çļĦ
ä¸Ĭ è¿°
æĿ ľ
åįļ çī©
æĽ´ æĸ°
èĢĮ è¨Ģ
å¯¹ è±¡
â ĳ
ĠW hen
ç» ĺ
ĠâĢ ĺ
ç² ĺ
åľ¨ è¿Ļ
å¾ ½
ãĢĭ ãĢĬ
ä¹ ı
æĺ Į
it es
æĪ ´
or th
Ġ Ã
201 1
Ġan other
er c
Ġop en
Ġacc ess
Ġad v
Ð µ
æ® ĸ
å½ĵ åīį
Ġb ro
b ack
æĸ° èĥ½æºĲ
æĲ ľ
å¼º çļĦ
ä¸ī åĪĨ
æĸĩ åŃ¦
Ġ1 1
æĽ´ å¥½
at ural
.. ..
ĠC ol
out put
çĽ¸ åĲĮ
æĹ ĭ
l ess
ivid ual
ä½ ©
åĽĽ å·Ŀ
çĶµ åĬ¨
Ġsqu are
å¼ Ł
åħļ å§Ķ
å¥³ æĢ§
çľŁ å®ŀ
é¢ Ĺ
è¿ħ éĢŁ
åħį çĸ«
æĮĩ æķ°
con st
ill ion
ĠD e
æĥħ ç»ª
èĥĮ æĻ¯
å®£ å¸ĥ
é» İ
é£İ æł¼
è¾ ī
ww w
ç¯® æĿ¿
èĲ¥ éĶĢ
åıĺ å¾Ĺ
å¹´ åīį
è ķ
G iven
è£ Ĥ
è¡¨ æĺİ
éĿ¢ çļĦ
æİĮ æı¡
å¹² éĥ¨
åĲį ç§°
in ation
C T
Ġ el
ä¸Ģå®ļ çļĦ
åĵģ ç§į
ï¼ ħ
¡èĲ Ħ
Ġris k
æĭĽ çĶŁ
ä¹ł æĥ¯
èĳ ¡èĲĦ
éĹ ²
ĠW h
Ġm aterial
w h
ä½ĵ çİ°
éĺħ è¯»
ä¸ĩ åĲ¨
ãĢĭ ãĢģãĢĬ
æĻ ĵ
s um
Ġch ar
Ġhe re
he ad
æ¡ ĥ
S S
Ġ else
iv ing
èµ ĸ
è¿Ĳ çĶ¨
ore d
äºº çĶŁ
é«ĺ çŃī
åĪĨ å¸ĥ
åħ´ è¶£
å·ŀ å¸Ĥ
å¾ª çİ¯
éĻ¢ æł¡
en ces
8 4
aj or
Ġincl ude
Ġ{ }
ç»ı åħ¸
ä¸Ń å°ı
æ¦Ĥ å¿µ
9 6
è½¬ åŀĭ
èı ²
ç´ł è´¨
or n
å²ģ çļĦ
èĦ ¸
ĠS ince
äº§ æĿĥ
Ġb est
æĺ Ĩ
å® ı
ĠHow ever
èļ Ģ
Ġed uc
åĸ ·
Ġp ost
èī ¾
ou th
å°Ĩ äºİ
è¿Ľ æŃ¥
d a
B C
åĿ ¦
Ġd el
Ġd en
v ar
çĪ¶ æ¯į
ific ation
çŁ³ æ²¹
æ¼ ı
Ġle arn
æ¸ ł
å¹´ é¾Ħ
é© »
è· ³
é«ĺ çº§
Ġme an
åĭ ¤
å±ķ çİ°
ut ure
è ²
éĨ ĩ
ç¥ŀ ç»ı
ç§ ¦
ĠE n
å¼º è°ĥ
èµ µ
èī¯ å¥½
åĮħ åĲ«
Ġle g
å¼º åº¦
æľĢ è¿ĳ
åıĳ çĹħ
å¹¸ ç¦ı
æĽ´å¤ļ çļĦ
æµ ®
æľº çļĦ
æİ¨ èįĲ
åħĪ åĲİ
Ġd ays
ä¸°å¯Į çļĦ
er ing
å°Ĩ ä¼ļ
ot al
ãĢĤ ï¼Ī
p re
Ġl and
åĶ¯ ä¸Ģ
è§Ĥ å¯Ł
ar c
æĺ¯ çĶ±
åį³ ä½¿
çĶŁæ´» ä¸Ń
éĻĲ åĪ¶
åĪ© çĽĬ
çļĦ ä¸Ģä¸ª
Ġph ys
ç«ŀ èµĽ
èĩ³ ä»Ĭ
çģ Ń
om s
} +
ä¸» åĬ¨
Ġre ce
ä¸Ģ ä½į
Ġs ocial
èĸ Ħ
æĲ º
åħħ æ»¡
åħļ çļĦ
æıĲä¾Ľ äºĨ
åĪ Ģ
çķ ħ
S ince
Ġ ide
åįĬ å¹´
an ces
Ġc ase
4 3
ap t
Ġt ext
Ġper form
å¦Ĥ ä¸ĭ
èĩª æĪĳ
åı¬ å¼Ģ
è¿½ æ±Ĥ
Ġle ast
Ġth ink
m p
æĮĩ æłĩ
ç»Ļ äºĪ
200 8
æķĻ ç»ĥ
^ \
P C
av ing
çĲĨ æĥ³
9 7
èĥ ¡
ot t
è®¨ è®º
èĬĤ çĽ®
è· ĥ
l u
å°ı ç»Ħ
å¼ Ĺ
Ġf ew
ict ion
cl usion
æ» ¤
æĶ¶ éĽĨ
æ²Ł éĢļ
æĴ ĳ
æĬķ æłĩ
åħ¬ ä¼Ĺ
Ġper cent
ĠR e
Ġn p
ä¸Ģ åĪĩ
P S
iqu e
æĩ Ĥ
oug ht
å¸Ĥåľº çļĦ
ãĢĭ ãĢĤ
çŃī å¥ĸ
Ġp ur
åĲ« æľī
Ġres p
du ct
æ²» çĲĨ
Ġl ow
c o
èĤ º
åıĳ è¡Į
çļĦ å¿ĥ
Ċ ĊĠĠĠĠĠĠĠĠĠĠĠĠ
4 1
æī £
ä¿Ħ ç½Ĺæĸ¯
ĠS o
äºº ä½ĵ
å¡ĳ æĸĻ
lob al
Ġen g
ĠE ng
Ġv ol
if t
r ate
Ġv iew
åĲĪ æł¼
9 8
Ġ åľ¨
Ġl aw
äºĭ æĥħ
å¥ ı
Ġind ividual
Ġcons ider
èħ ¾
éħį åĲĪ
Ġf in
Ġw omen
é¼ĵ åĬ±
K ey
ys is
åĵ ²
] .
B A
çĺ ¤
æĦŁ åĪ°
å°ĳ å¹´
Ġcon f
ĠUn iversity
èī² çļĦ
Ġbe g
èĢ ¶
Ġan im
åŃ ķ
y le
çĮ ª
Ġn ec
Ġrequ est
æĬ ĳ
çļĦ æĬĢæľ¯
ust om
Ġal ways
em ber
å®ŀ è¡Į
åľ° ä½į
le ction
åĪĽ å»º
å¾Ī å¤§
os p
Ġa ut
åĮħ è£ħ
æĦı å¤§åĪ©
æĹ¥ èĩ³
d es
Ġ ĉĉ
è§Ĵ åº¦
Ġall ow
å®Į æķ´
çļĦ åľ°æĸ¹
d f
åįļçī© é¦Ĩ
Ġim pro
a ut
Ġbel ie
æĺ¾ èĳĹ
éĺŁ ä¼į
æĦı åĳ³
è¿Ļ ä¹Ī
it or
æĶ¶ çĽĬ
Ġm us
7 8
Ġtri angle
Ġc ult
éĵģ è·¯
çº¿ ä¸Ĭ
çº ¹
ent al
Ð¾ Ð
å°¤åħ¶ æĺ¯
å¼º åĮĸ
æµ ¦
éĻ ·
åįı è°ĥ
Ġrep resent
èĭ± è¯Ń
æŁ Ķ
ent ion
al le
é ŀ
èĴ ¸
éĩĮ çļĦ
çī¹ å¾ģ
æĪĲ äºĨ
Ġn ext
et a
åħ± åĴĮåĽ½
æĽ´ æĺ¯
er r
b s
åĲ Ľ
è´¯ å½»
ag ement
çī© çļĦ
Ġb ased
p ec
Ġpos itive
åĲĮ æł·
t x
def ault
Ġcon fig
å¤§ éĥ¨åĪĨ
M T
A l
Ġ Ċ
ç´¯ è®¡
ge q
N ow
iel ds
ç¦» å¼Ģ
ip le
å°± åı¯ä»¥
å¤§å¤ļ æķ°
çĶ ľ
Ã ³
S ub
) ãĢĤ
oh n
ç¦» åŃĲ
ill s
\ ).
U n
ç¡ķ å£«
èĤ¡ ä¸ľ
æµ· å¤ĸ
ect or
æľ¬ èº«
å° º
ä¼Ĺ å¤ļ
} ^{
u ction
èĬ ¯
æīĢ åľ¨
Ġc aus
5 8
äºº åľ¨
è¯¦ ç»Ĩ
èŀ º
ent ly
4 00
åı° æ¹¾
çī© èģĶç½ĳ
åĪº æ¿Ģ
ĠCom m
è´¢ åĬ¡
åĲĦ ä¸ª
ĠThe refore
ä¸ļ ç»©
èµ «
Ġin put
Ġresult s
Ġap pe
åĩĨ ç¡®
ä¸Ģ çĤ¹
å® ħ
ĠĠĠĠ Ġ
å§Ķ ä¼ļ
Ġ1 7
Ġav ailable
requ est
oc us
am b
çĻ½çĻľé£İ çļĦ
ĠP h
as ing
an e
è§Ħå®ļ çļĦ
ind ows
Ġ âĢĶ
val id
çİ¯ èĬĤ
åģ ¶
è¿Ļ æ¬¡
i ans
æ¸¸ å®¢
ä½¿ å¾Ĺ
t ies
E T
çļĦä¸Ģ ç§į
éĺ² æŃ¢
ic le
5 7
ä¹¡ æĿĳ
æµģ ç¨ĭ
Ġh ig
å® ¿
çļĦ çłĶç©¶
Ġke ep
åĬ© æĶ»
Ġh ome
S o
åĩł ä¸ª
åıĤ èĢĥ
æĶ¹ éĢł
Ġex ist
Tr ue
æ» ¨
ç¾ Ĭ
çĤ Ń
ä¸Ģ å®¶
W hat
åįģ äºĮ
ä¿¡ åı·
éĻ ¶
or ld
Ġper iod
æĬ¤ çĲĨ
en ame
M A
Ġ 50
çİ© å®¶
äºĭ é¡¹
æĸ° åŀĭ
6 8
è£ħ ç½®
ul es
æ¬ £
å¤ļ å°ĳ
cri pt
ĠG od
æī «
Ġp ain
in fo
m y
C D
èĸ ª
æĪ¿ åľ°äº§
çļ Ĩ
- \
Ġass oci
çľģ çº§
al f
v ious
5 2
Ġagain st
éļľ ç¢į
Ġm ajor
æ°Ķ åĢĻ
Ġo pt
x y
èħ ¹
v es
Ġbec ome
å¤ļ å¹´
æī °
å° Ŀ
Ġt urn
htt p
æ¼Ķ åĳĺ
èĩª æ²»
Ġto o
Ġf inal
p ack
éĺŁ çļĦ
çĶŁ ç´ł
E S
0 2
Ġprov ide
è§£ éĩĬ
è¿ĺ è¦ģ
ä¹ ĥ
Ġus er
æĽ¾ ç»ı
å¹¶ åľ¨
æĸ° æĬĢæľ¯
eg in
èĤ¡ ç¥¨
ä¼ĺ æĥł
un g
5 9
æĬķèµĦ èĢħ
èģĶ çĽŁ
v ed
åĬŀåħ¬ å®¤
éĶ ģ
æĻ ¨
åĲİ æĿ¥
å½ ¼
T ext
ä¼Ļ ä¼´
æĻ¯ åĮº
ft ware
Ġ1 3
Ġg l
æ² ĥ
U T
flo at
èĦ ı
c rib
æł¹ æľ¬
çģ °
æ° ¢
Ġs ize
at ures
d is
#### ####
åħ± äº«
æ´ ª
æł ı
Ġb us
ing le
P I
Ġche ck
çĩ ¥
è¡Ģ ç®¡
Ġcont rol
è£ħ å¤ĩ
å¿ĥ çļĦ
t ri
Ġcond itions
åĲ¸ æĶ¶
äºİ æĺ¯
Ġmon th
æ¹ĸ åįĹ
th on
Ġd at
m m
å¦ »
å» ī
æ¬ ²
F I
Ġc y
Ġs ource
Ġspec ific
Ġcirc le
ä»ª åĻ¨
ç¾İ ä¸½
éĥ½ åľ¨
d ated
! ("
Ġf ield
m atch
åĽŀ åºĶ
æīĢ å¾Ĺ
ä¹Ł å°±æĺ¯
æĪĲ å°±
on es
ob ject
æĭ ¼
åŃ¦ åİĨ
Ġd oc
er ror
200 7
èĤ Į
Ġan t
Ġgovern ment
Ġequ al
end s
Ġs at
I d
åİĤ å®¶
éĽ ķ
ä¼ļ ä¸Ĭ
å¯ ¸
Ġam ong
ç¬¬ äºĶ
V alue
cri ption
pl it
ãĢĤ ãĢĬ
å±ķ è§Ī
ä¼ ¸
ap er
ul a
çĶŁ éķ¿
åĬ ²
Ġa ir
Ġfam ily
è§Ĵ èī²
ail s
ä»£ çĲĨ
å¸ĥ å±Ģ
ur ation
è¾ ĸ
å¾ Ĵ
Ġc ode
è¡Įä¸ļ çļĦ
ure d
og n
åº¦ çļĦ
æĦıåĳ³ çĿĢ
èĶ ¬
ĠS tr
åĲ« éĩı
åŃĲ çļĦ
Ġre st
æĪĲ çĨŁ
ä¼ļ æľī
éŃ Ķ
åºĶçĶ¨ äºİ
le ase
åį ĵ
t il
? ;
é©¾ é©¶
éģĩ åĪ°
æįŁ å¤±
Ġev ent
åıį æĺł
åģļ åĩº
æķ° åŃ¦
ur ther
om ain
in st
èĩ´åĬĽ äºİ
çļĦæĥħåĨµ ä¸ĭ
Ġdist ance
Ġh app
Ġm en
çº¤ ç»´
å¥¥ è¿Ĳ
æĦŁ è°¢
èĪ į
æĭ Ķ
Ġc ause
èĤ¡ä»½ æľīéĻĲåħ¬åı¸
Ġbet ter
åĽ´ ç»ķ
éĩĩ è´Ń
Ġse ver
og le
eth ing
æĶ¯ æĴĳ
åįģ å¹´
æ° Ľ
æ¸ħ æ´ģ
ä¸ĭ éĿ¢
ĠTr ue
Th us
çĵ ľ
200 9
çļĦ åĲĮæĹ¶
çī¹åĪ« æĺ¯
çªģ åĩº
Ġneed s
çĪ± æĥħ
è¿Ļ ä½į
Ġ ess
é¢ĨåŁŁ çļĦ
im age
} .
R eg
æ°Ķ ä½ĵ
å¤ļ æ¬¡
ä» ĵ
j son
Ġab ove
å½ĵ ä¸Ń
æĪĲ åĪĨ
è Ŀ
Ġ id
Ġde p
ex pect
éĢı è¿ĩ
åĬł ä¸Ĭ
Ġloc al
è´§ å¸ģ
ock er
ä¸» å¸Ń
Ġb lood
ĠUn ited
å¦Ĥæŀľ ä½ł
äº ©
çļĦ æĸ¹æ³ķ
Ð ¸
ä»ĸ åľ¨
çŃī æĸ¹éĿ¢
è¾ ½
M P
èĤ Ŀ
äºº æķ°
is ed
ä¸»è¦ģ æĺ¯
ap s
ä¸ĭ åįĪ
é¸ Ł
Ġ\( \
çļĦ æľįåĬ¡
O S
æħ Ī
äºĭ æķħ
äº§ éĩı
è¯ ŀ
æ£® æŀĹ
æŃ¦ æ±ī
ç»´ ä¿®
åĢ ¾
çºª å½ķ
pl ace
C ol
Ġear ly
æĭĽ èģĺ
å½± çīĩ
is ter
æ §
} =
ĠO r
çłĶç©¶ çĶŁ
Ġs ides
y d
å¥ ī
ä¸Ńåįİ äººæ°ĳ
ä¼¼ ä¹İ
ĠSt ates
ç³»ç»Ł çļĦ
Ġcount ry
å¥¹ çļĦ
Ġpl ant
æĢ» ç»ĵ
éħ ¯
ä¼ļ åĳĺ
ic ation
Ġc ertain
z ure
ä¸Ńåįİäººæ°ĳ åħ±åĴĮåĽ½
å¨ ±ä¹Ĳ
æĢĿ èĢĥ
åįı åĬ©
un e
Ġp ut
éĢĲ æŃ¥
åĽ¾ ä¹¦
ht ml
åĩº çĶŁ
å¹ »
æĭį æĳĦ
åı¯ä»¥ åľ¨
Ġare as
åı¯ éĿł
M L
orm al
con n
å¸¦ é¢Ĩ
æĹ¶ çļĦ
A p
Ġstr ing
op er
s a
) (
åĩ ½
à ¤
ĠS e
O T
éļ¾ ä»¥
Ġse qu
æº ª
æĸĩ åŃĹ
åĲĮ æľŁ
bo ok
æıĲ äº¤
å¤§ åĬĽ
in ter
Ġspe ed
Ġcond ition
\ ),
æĭĴ ç»Ŀ
å®¶ éķ¿
åĩ ī
olog ical
Ġin tern
Ġf ore
å±¥ è¡Į
èĤ¯ å®ļ
æĤ£èĢħ çļĦ
ce ption
a i
ver age
å¯¹ å¤ĸ
ac y
æľī å¾Īå¤ļ
ä» ¿
ĠAmeric an
æĢģ åº¦
ir t
ç¨ ¿
å¯¹ æĸ¹
ä¸Ģ åĲį
éħį å¥Ĺ
ä¹Ł åľ¨
é¢ ģ
éĻ ķ
Ġm ov
fun ction
Ġacc ount
å¿ ½
à ¼
è² Į
ä¸¤ ç§į
cont ent
Ġcomp ut
Ġn et
Ġa ffect
he l
çļĦ ä½ľçĶ¨
6 9
" );
æĳ Ĩ
og raph
Ġ2 5
çĸ Ĩ
Ġre d
Ġs w
i ver
æ¯ķä¸ļ çĶŁ
ç»´ çĶŁç´ł
è®¤ åı¯
åºĶ æĢ¥
äºĳ åįĹ
åĪ¶ åĵģ
==== ====
Ġinv olv
Ġ[ ]
æ·± åº¦
ay er
l n
è£ħ é¥°
çī §
0 8
ä¸ĵä¸ļ çļĦ
æĦŁ åıĹ
æŃ£ æĺ¯
ä½ľ åĩº
A r
Ġec onom
rib ute
åĽŀ æĶ¶
ä½ł ä»¬
o ogle
æłĩ å¿Ĺ
ri x
åľº æīĢ
å° ĸ
åĭ Ł
è§Ħ åĪĻ
æĽ´ å¥½çļĦ
Ġpartic ular
Ġab le
ĠG erm
å¤© æ´¥
åĲį åįķ
ä¸» åĬŀ
æķ ¢
( (
Ċĉĉ ĉĉ
é¢Ħ æµĭ
æµĭ éĩı
rac e
åı¯ æĮģç»Ń
æĹ¶ åĪ»
ä¸į åĨį
Ġp o
Ñ Ĥ
Ġadd ress
éĤ ¦
è®¸ åı¯
å¼ķ å¯¼
éĿ¢ åĲĳ
æı Ĵ
Ġe ither
åĴĮ åħ¶ä»ĸ
app end
7 9
Ġsever al
åĽ½åĨħ å¤ĸ
ail ed
æĿ Ń
Ġen s
ag n
çİ° æľī
om et
æĬ ±
t ain
Ġdise ase
éĢĤ çĶ¨äºİ
Ġl anguage
Ġn atural
åĨ Ĵ
ed u
åľ¨ äºİ
Ġpos ition
æĤ¨ çļĦ
7 2
Ġtyp es
åĪ© äºİ
O k
ä¸ī å¹´
ou d
p or
Ġen c
end ed
çĪ¶ äº²
éļı åĲİ
Ġw ar
0 6
Ġrel ations
è° ĭ
ĠA d
ic ense
b egin
å© ´
æ¡Ī ä»¶
em pt
æģ Ĳ
å»º æĪĲ
åĲĪ æĪĲ
5 4
read y
åĪ¶éĢł ä¸ļ
ĠO n
ĠC ent
ro ll
. __
Ġnec ess
get her
de v
æ³ µ
Ġto gether
èİ· åıĸ
Ġm aking
çļĦ åīį
æ¸ł éģĵ
tr y
å·¥ä½ľ äººåĳĺ
Ñ Ģ
é©± åĬ¨
æĶ¿åºľ ä¿¡æģ¯
çĶµ èĦĳ
H ow
A s
Ġne g
Ġst andard
å° ¿
Ġ 60
Ġorig inal
Ġsim ilar
Ġwor ds
èĻ İ
å¤§ èµĽ
ä¹ Ķ
' '
Ġsom ething
Ġsu ccess
æī¿ åĮħ
N ode
Ġbeh av
åľ° çĲĥ
ç½ĳ ä¸Ĭ
å®ļ æľŁ
Ġhist ory
åį± å®³
ç¡® è®¤
ä¸» ä½ĵ
B y
æĹ© å·²
ä¸ĩ äºº
å¯ º
on t
Ġexp ression
Ġsc ient
åľ° åĿĢ
f act
0 3
è¿Ŀ æ³ķ
Ġsim pl
åİŁ æĸĻ
æīĭ æ®µ
èĩ³ å°ĳ
Ġl ater
ec ut
Ġth ings
ä¸Ģ èĩ´
8 2
Ġne ar
å°± åĥı
ä»¥ åīį
æķ ¦
al es
Ġs ay
Ġrequ ired
åĳ¨ æľŁ
tr ans
åĪ« äºº
éĥ ģ
åħ¨ ä½ĵ
Ġh ard
å¿ §
å¤§ å¤§
ic y
Ġa ge
5 3
æ¹ĸ åĮĹ
å±Ĥ æ¬¡
Ġres pect
æ´» æĢ§
at ors
m ark
j oin
æ¸ħ æ¥ļ
ä¸ĵ éĹ¨
Ġt re
0 4
ffic ient
æł¡ åĽŃ
éĥ Ń
n o
b re
Ġ 2021
ç¿» è¯ĳ
Ġli k
ff er
éĺ² æİ§
ct ions
èĤ ¾
er o
æŃ¤ åīį
æį Ĳ
çĻ¾åĪĨ çĤ¹
æ£Ģ éªĮ
éĶ Ī
å¿ Ļ
æĢĿ ç»´
Ġtr y
çĽ¸ äºĴ
Ġd ue
è¯ ±
è¿ Ī
5 1
é»ĳ èī²
ĠU S
çłĶç©¶ éĻ¢
æ» ´
æİ ĺ
ç¢ İ
è½¬ åĮĸ
ç±» ä¼¼
éĥ¨ ç½²
ä¸Ĭ æ¶¨
ä» Ļ
e le
itt le
è¡¥ åħħ
å¤§ å¹ħ
æ·· åĲĪ
åħ ģ
Ġ !
Ġsol ution
che ck
ight s
ä¸ĵ é¡¹
éĥ¨ ä»¶
äºº åĬĽ
Ġsh ort
ut es
çļĦ å¥½
I ON
Ġhour s
åı¥ è¯Ŀ
yn c
éħį ç½®
æĶ¾ åľ¨
ç²¾ å½©
Ġ ĉ
æľĢ æĸ°
id th
Ġm atch
è ¹
r s
çĵ ·
è®© æĪĳä»¬
ä½ľ ä¸ļ
å¤§ çº¦
Ġimp act
éĤĢ è¯·
çĶ³ æĬ¥
åĽŃ åĮº
Ġcon c
éĺ Ķ
b b
Ġ ver
Ġcont ain
ĠL et
() );
éĵ º
æĺ¯ ä¸į
å¹³ è¡¡
çī ¢
Ġp ress
Ġo s
ä¸Ģ æĿ¡
Ġer ror
Ġsign ific
Ġind ust
å®¤ åĨħ
Ġd og
Ġf il
Ġ ï¼Į
Ġfe el
çĵ ¶
ç»Ħ åĲĪ
çļĦ ä¸Ń
p ose
è¡Ĺ éģĵ
ä¾Ŀ çĦ¶
èĢģ å¹´
ĠE r
æ¸ħ æ´Ĺ
ä¸Ĭ åįĪ
Ġ1 4
åİ ¦
R O
Ġincre ase
ç¾İ æľ¯
èµĦ è´¨
çĶµ åķĨ
Ġf ocus
åħ ¹
s ing
çŁ¥è¯Ĩ äº§æĿĥ
èİ·å¾Ĺ äºĨ
ä¸Ģä¸ª äºº
æľŁ å¾ħ
ĠA ss
ä¸Ģ æĹ¦
g ing
çļĦäºĭ æĥħ
å¼ķ åıĳ
ä¼ĺ åħĪ
æĬĢæľ¯ çļĦ
Ġal ong
e ps
Ġte am
æŃ» äº¡
æķĪ çĽĬ
stit ute
Ġr ate
åĪĨ ç±»
è¡Į çļĦ
th ough
æĭ Ĩ
I C
ç»´ æĮģ
ĠL e
å¾® ä¿¡
ç¢ ±
str uction
çĻ½ æĸĳ
Ġcan cer
rac k
å·¥ åİĤ
æĺ¯ ä¸ŃåĽ½
I m
å½ķ åıĸ
æĢ» ä½ĵ
Ġ2 4
æĹ¥ åīį
Ġw ays
re l
çļĦ çĥŃ
Ġben ef
æĤ ¬
åĽŀ åĪ°
ä¿Ŀ åģ¥
æı Ń
ä¸Ģ æ®µ
ä¸Ģ æµģ
t ings
æ²³ åĮĹ
å¾Ī éļ¾
9 3
) ãĢģ
Ġpot ential
éĽ¶ åĶ®
å¤į åĲĪ
å¯¼ æ¼Ķ
ĠF alse
å·¥ åķĨ
ä¸ª çĻ¾åĪĨçĤ¹
Ġs it
H E
uro pe
èµ¢ å¾Ĺ
å¾Īå¤ļ äºº
å®¡ æŁ¥
}{ \
ç¡ ħ
Ġs ays
ç¬¬ä¸Ģ æ¬¡
æķĻèĤ² éĥ¨
Ġtr ad
Ġim age
ial ize
n p
W h
Ġhtt ps
æ·» åĬł
éĤ »
um n
1 50
èĥ½ éĩı
d b
é¢ľ èī²
æīĭ æľ¯
å®ī å¾½
çº º
Ġchang es
èħ º
æĿĥ åĪ©
:: {
ä¹ĭ ä¸Ń
çļĦ æ°´
{ }
Ġother s
ar ray
Ġf ull
åľ¨ æŃ¤
à¼ ĭ
ãĥ¼ ãĥ
èĩªåĬ¨ åĮĸ
é£Ł çĶ¨
to ols
å¦ Ļ
st atus
Ġf ree
èī °
Ġt arget
Ġsp ace
æĻ® éģį
æ¨¡ åŀĭ
cl one
å¾Ī å¤§çļĦ
ç« ¹
çļĦ ä¸į
av es
æĤ ²
çĲ ´
æ° ¯
Ġm ar
Ġf low
Ġp arent
Ġ ë
åį± éĻ©
ic ult
Ġp ort
å¿Ĺ æĦ¿
åľº æĻ¯
æĢ ª
å¹² çĩ¥
ĠB y
l ing
d own
ugg est
ä½¿çĶ¨ çļĦ
Ġcom e
åĬł å¤§
re c
Ġpar am
å¤© æ°Ķ
G B
èĭ ¹
åħ¬ çĽĬ
å¥ ĳ
èµ ¶
Ġf ac
it ch
ip s
çĪ ¸
è¯´ éģĵ
æĽ´ ä¸º
æīĢ è°ĵ
ut ions
å¤§ ä¼Ĺ
z e
i us
1 20
åį³ åı¯
æĪ¿ å±ĭ
Ġ4 0
Ġg ives
Ġinv est
é«ĺ ç«¯
st art
èĳ£äºĭ éķ¿
çŃĸ çķ¥
ard s
Ġval id
éĢĤ å½ĵ
è¿Ľ çĲĥ
ä»¥ ä¸º
ä½İ äºİ
n ow
Res ult
ç¼º ä¹ı
çĶ³è¯· äºº
æĹ© æľŁ
pro cess
con text
æ·± åĪ»
èµĽ äºĭ
éĩĳ é¢Ŀ
çļĦ è¦ģæ±Ĥ
p ed
Ġquest ion
Ġpol it
èŀį èµĦ
å¿« ä¹Ĳ
æģ ĭ
) $,
Ġ ĊĊ
çĭ Ĥ
ach ine
ĠM ar
ç§į æ¤į
Ġw rite
n al
a u
èĶ¬ èıľ
æĢ» æĺ¯
P l
ound s
äººæ°ĳ å¸ģ
å¤ļ åħĥ
èħĲ èļĢ
åºŁ æ°´
Ġspec ies
æĿ¡ ä¾ĭ
ab ly
é«ĺ æ¸©
å¯¹ æīĭ
Ġb ase
Ġproble ms
æĢ» ç»ıçĲĨ
ä¸ĵ æ³¨
éľ į
d at
NA ME
éĻ¢ éķ¿
ä¸»ç®¡ éĥ¨éĹ¨
è¿ĳ æľŁ
ä¿¡ å¿ĥ
çĦ Ĭ
å» ·
æľī ä¸Ģä¸ª
d ict
åĪĻ æĺ¯
é¡¹çĽ® çļĦ
ç®¡ éģĵ
çĽ Ī
éĿ© åĳ½
å·® å¼Ĥ
com p
ç¾İ çļĦ
éĶ ¡
åĲį ä¸º
æ¸ Ĺ
å¿ ł
èµ ĭ
èĭ¹ æŀľ
åĨľ æ°ĳ
Ġst ep
0 9
åł Ĩ
éģĵ å¾·
ä¸ Ļ
i res
P ar
Ġpre vent
cl ient
åĻ¨ çļĦ
çºª å¿µ
ear ch
Ġst d
éĢ Ĩ
7 3
å¯¿ åĳ½
é½ ¿
av a
æĮ ĸ
om in
is on
t itle
Ġserv ice
ĠRes ult
å¯» æī¾
è®¾å¤ĩ çļĦ
çĥ ¦
ug ht
Ġcan not
ĠE urope
éĵ ¸
Ġpro m
ä»ĸ äºº
Ġp riv
åį µ
6 3
çĮ «
è¯Ĩ åĪ«
ç¡ «
ĠA ll
æķ Į
è®º åĿĽ
Ġun til
The re
å¤Ħ ç½ļ
ĠP art
åŃ¦ èĢħ
O C
èį£ èİ·
Ġ\ ):
Ġp i
s y
c y
> >
Ġdef ault
æ¡ ĳ
è¾ ŀ
Ġl en
ä¸Ģ åľº
Ġcour se
åŁ¹ èĤ²
Ġde pend
ĠA t
åĲĪ éĩĳ
l s
\ _
S h
the ta
å¼ķ é¢Ĩ
åĪĽ æĦı
ä¼ļ çļĦ
Ġexp ress
let e
Ġcom bin
å®ļ ä½į
åĨ »
čĊ čĊ
ĠM an
ur ity
æĿ¥ åĪ°
Ġc rit
åĽ½å®¶ çº§
èĥ İ
æ¶Ĥ æĸĻ
å¹¶ æ²¡æľī
åľ° çĤ¹
çī µ
b it
è¯Ĭ æĸŃ
å£° éŁ³
.. /
èĥ Ĩ
åľ° çĲĨ
æĹ ģ
éĻķ è¥¿
è¿ĺ åı¯ä»¥
Ġa ction
u it
å¹¿ä¸ľ çľģ
çĬ¯ ç½ª
Ġrequ ire
ä¸Ģ è·¯
Ġc ases
, "
ify ing
ak en
èĢĥ æł¸
å½± è§Ĩ
æĬ¥ èĢĥ
æĪĸ è®¸
å°ı çļĦ
éĺ Ģ
åĪ° çļĦ
lect ed
å£ ³
and om
om es
äººæ°ĳ æ³ķéĻ¢
åī ©
Ġp ast
is es
Ġs uggest
ì Ŀ
tri angle
ĠO ption
çĽ´ æĴŃ
çłĶç©¶ æīĢ
res p
ä¸ĭ äºĨ
å¸ ķ
äºĴ åĬ¨
ap i
èµĦ è®¯
ĠA dd
Â °
( -
èµ ł
æľī åı¯èĥ½
Ġwork ing
æĢ» é¢Ŀ
ç¼ Ŀ
æıĲ åīį
L ist
F l
B u
fil ename
èį£ èªī
Ġspec ial
éķ¿ çļĦ
çİ Ľ
Ġim plement
res ponse
éĶ Į
ä» Ķ
u ation
cre ate
åİŁ çĲĨ
Ġal ready
âĢ ¢
Ġocc ur
åĩĢ åĪ©æ¶¦
æĥħåĨµ ä¸ĭ
é¢Ħ ç®Ĺ
ä¸ĸçķĮ ä¸Ĭ
et ers
D e
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
æ»¡ æĦı
ä¸ĭ è½½
çļĦ éľĢæ±Ĥ
6 2
led ge
Ġh ouse
er al
9 2
è¸ ª
ann el
Ġsol ve
è¥¿ å®ī
äºĭ åĬ¡
å¤§ æķ°æį®
8 3
) );
Ġ ve
éĺ³ åħī
Ġwh y
ag er
çł ĸ
å¸Ĥ æ°ĳ
Ġs ingle
lab el
æľºåĻ¨ äºº
å·´ é»İ
ĠB e
å°± èĥ½
Ġg ive
il t
W hen
Ġ â
ä¼¤ å®³
æµģ åĬ¨
åıĸå¾Ĺ äºĨ
pos ition
çīĪ æľ¬
æ³¨ éĩį
E D
9 4
ess ion
å®¶ çļĦ
åı¯ è§ģ
åĩ Į
r un
6 00
Ġac ross
æĻ¯ è§Ĥ
od es
æķ´ åĲĪ
éĴ Ļ
å½ ¹
èľ ľ
å§ Ĳ
åĮ ¹
Ġexper ience
Ġup dated
de pend
Ġus ize
ç² Ĺ
Ġl ittle
åĴĮ ç¤¾ä¼ļ
n ode
æ¢¦ æĥ³
è¸ ı
Ġwor ks
æĶ¯ åĩº
ĠF r
Ġl ib
éĻ µ
å· ¡
ä¸Ģ ä»£
m ethod
I V
Ġrelations hip
åįĬ åľº
ra ft
Ġ+ =
éĥ½ ä¸į
Ġb ig
æĺ ¨
l in
åĵ² åŃ¦
Ġcre ated
Ġrec ord
ach ing
è®° å¿Ĩ
ĠO ne
åħ± æľī
ç½ĳ åıĭ
Ġsub ject
åį³ å°Ĩ
id x
Ġl oss
O r
çł´ åĿı
Ġwhe ther
å°ı è¯´
éĽ ¾
Ġb i
ä¸Ģ æĺ¯
is f
c s
b ol
æ¶ ¯
åĽ½ å¤ĸ
åľ¨ ä¸Ģèµ·
D P
oci ety
çĽ¸åħ³ çļĦ
Ġab s
Ġyou ng
è®¤ å®ļ
çĶµ æ°Ķ
çº µ
çļĦ åİŁåĽł
Ġcle ar
ĠCh rist
çĸ« èĭĹ
åł ¡
Ġout put
èī² å½©
è° Ĳ
èĢĮ åľ¨
a im
èĥľ åĪ©
çĪ± çļĦ
çĸ ı
èĩª è¡Į
il ities
ä¸Ĭ äºĨ
è¡ °
C M
åĬł çĽŁ
æĥ ľ
o ff
o ad
Ġdeterm ine
Ġgener al
Ġte ac
çº³ ç¨İ
Ġap p
ä¿¡æģ¯ åĮĸ
æľŁ åĪĬ
ç¬¬ ä¸Ģä¸ª
ç¡® å®ŀ
200 6
æľŁ æľĽ
åĬł éĢŁ
Ġinteg er
Ġbr ain
æİĪ æĿĥ
Ġap plication
ãģ ®
èİ ²
å¾Ī å¥½çļĦ
ä»£ çłģ
åĮº çļĦ
æĸ° åĨł
é ¬
c f
åĮĹäº¬ æĹ¶éĹ´
Ġse g
åŁİ ä¹¡
éĽĨ ä½ĵ
ar r
u id
l im
A dd
A ll
Ġbus iness
å´ ĩ
ç»Ī äºİ
éĹ®é¢ĺ çļĦ
åķ Ĭ
å¹¶ ä¸įæĺ¯
çĲĨ äºĭ
I L
è§Ĩ è§ī
to ken
Ġto day
Ġd er
ro du
å¸ ħ
Ġo ption
ä¸Ģ å¤©
U S
7 4
idd le
åĩŃ åĢŁ
ĠW est
Ġh alf
U N
èĤ¿ çĺ¤
è¯ļ ä¿¡
Ġpr im
è½¬ åıĺ
æĪĸ æĺ¯
åĲĮ æĦı
æĸ° å¢ŀ
å·¥ èµĦ
S ome
åŁºç¡Ģ è®¾æĸ½
æ¯ı ä¸ªäºº
res h
Ġa way
çļĦ æķ°æį®
Ġlik ely
åĽº å®ļ
åŁº å±Ĥ
al ance
( |
Ġcell s
åĽ¢ ä½ĵ
Ġs ens
g es
ç¼ĸ åĪ¶
å®¡ è®¡
ĠF rom
ĠP r
åľ° ä¸ĭ
åĽ½ æľī
æĪĲç«ĭ äºİ
Ġtr ain
ĠE ar
å®ļ ä¹ī
ad r
as et
or der
Ġsignific ant
by tes
å®¡ æł¸
ä¿® æĶ¹
èħ Ķ
éĢĤ çĶ¨
è°ĥ èĬĤ
ĠW orld
Ġinst all
åĨ² åĩ»
æĦ¿ æĦı
Ġdes crib
ign ed
Ġcont ent
åı¯ æĺ¯
Ġp ack
Ġc ur
éĢļ è®¯
çļĦ æķħäºĭ
P h
å¼ķ è¿Ľ
è¡¨ æ¼Ķ
çł Ĥ
åħ¶ å®ĥ
åħ¨ çľģ
Ġa verage
h and
åĩł å¹´
é«ĺ ä¸Ń
il der
å¤§ éĩıçļĦ
Ġs ent
s ide
o ot
Ġ version
äººå·¥ æĻºèĥ½
æ¶Ī éĺ²
nd er
éĤ£ ä¸ª
æµ· æ´ĭ
æĦı æĢĿ
ä¼ļ åľ¨
åĩ ¤
Ġc over
çļĦ ä¸»
Ġang le
Ġtem per
ib ility
æ¡ Ĩ
om an
â Ķ
p ng
a e
UR L
ä¸Ĭå¸Ĥ åħ¬åı¸
Ġbel ow
çº¢ èī²
Ġcomp lex
op s
æĪĳä»¬ åľ¨
Ġtreat ment
æŁĲ äºĽ
Ġpr int
Ġstr ong
ä½ı å®ħ
è¾ĥ å¤§
å±± è¥¿
de bug
Ġin equ
f ield
F ile
æĺ¥ èĬĤ
åĦ¿ åŃĲ
çĽ´ åĪ°
èĢĮ ä¸į
Ġm akes
çĨŁ æĤī
æĲ ¬
æĸ¯ çī¹
um ents
å¯ Ħ
Ġf urther
Ġbeg in
Ġind ic
Ġk ind
ĠN ational
æĪĲ çļĦ
ä¸į éĶĻ
éĢ ĥ
S et
$ \
éĶĻ è¯¯
Ġdiff icult
æīĢæľī çļĦ
ĠA zure
ro ot
s up
ĠV ec
ä¹ī åĬ¡
çħ§ çīĩ
æµ· åįĹ
è® ¼
åĲ ¹
he ck
F F
å¦Ī å¦Ī
ç«ŀäºī åĬĽ
æ¼Ķ åĩº
åıĤ è§Ĥ
è¾ĥ ä¸º
Ġex act
th ing
åŁº åĽł
Ġm il
( [
å¾ĭ å¸Ī
åĽ¾ çīĩ
ac c
çļĦ åİĨåı²
Ġcons um
èģĮ è´£
èĢĥ å¯Ł
Ġwe ight
æĪĳ æł¡
å¹´ åºķ
æĬ «
çļĦ å¸Ĥåľº
è´µ å·ŀ
åĪ¤ æĸŃ
Ġim pl
ĠI nt
Ġm illion
æľī åĵªäºĽ
Ġf alse
è¿ Ł
äº Ń
0 7
æıı è¿°
æĭĵ å±ķ
éĻĦ è¿ĳ
æĿĥ çĽĬ
ï¼Ł âĢĿ
åıĤ èµĽ
åįĹ äº¬
æĹ¥ åľ¨
Ġf uture
Ġres ponse
æ· ĺ
åŃ ¤
åħ¸ åŀĭ
åīį å¾Ģ
å»º éĢł
ĊĊ ĉĉ
Ġphys ical
Ġchar acter
çī¹ æĢ§
å¤ļ æł·
I nd
) =
äºº çī©
ar ing
ed s
en e
å Ĺ
f s
è¯ī è®¼
åį° åĪ·
å±ħ ä½ı
å¤§åŃ¦ çĶŁ
ist ic
è¾ £
çĽ ¾
Ġs ure
I M
Ġcons id
æĺŁ æľŁ
æ¼ Ĩ
ä¼ł æī¿
ĠI s
æĸĩ çī©
å¾Ī å¥½
ä½¿ åĳ½
ol l
æĪ Ĵ
in ary
8 1
åĲį åŃĹ
æľĢ ä½İ
f r
äºĪ ä»¥
ç¼ĸ è¾ĳ
() :
ç¾İ å¥½
åĽ Ĭ
l ight
çŃ¾ è®¢
å§Ķ æīĺ
ç¥ ¥
æľĢ å¥½
D ef
Ġpat tern
ä»¥ä¸ĭ ç®Ģç§°
åĬ© åĬĽ
ä¸¤ å¹´
ĠM ed
å¯¹ æŃ¤
u ed
Ġcalcul ate
æ¬§ åħĥ
Ġne ver
ud io
åĲĪ æ³ķ
m on
Ġcommun ity
å¤± åİ»
å¾Ī å¿«
å¾Ĺ åĪ°äºĨ
èĮĥåĽ´ åĨħ
æĺ¯ä¸Ģ å®¶
ĠJ ohn
Ġk m
è§Ĥ çľĭ
Ġus ually
ag ed
ol der
ac ed
è¯¾ é¢ĺ
æīĵ å¼Ģ
æ¢ ¯
åĬĽ åº¦
åıĳ åĬ¨
ä¸į èī¯
Ġhig her
æ© ¡
ä»ª å¼ı
Ġsim ple
che d
é»Ħ éĩĳ
éĿĴ æĺ¥
å¸¦ æĿ¥çļĦ
æµ ¸
èĢ ķ
al t
m ost
Ġlevel s
sl ant
Ġsystem s
å¼Ĥ å¸¸
åĨ³ çŃĸ
æ£ Ĵ
iz ing
äºĮ æĺ¯
um p
ä¸Ń åĮ»
Ġa uthor
å¤ı å¤©
åģľ æŃ¢
ove red
text bf
åħ¨ å¸Ĥ
ol ve
Ñ ģ
æ¯į äº²
åī ĳ
è¦ģ æ³¨æĦı
çļĦ è®¾è®¡
í ķ
æ°¸ è¿ľ
ON G
çıŃ çīĻ
ä»¥ä¸Ĭ çļĦ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
è¥¿ çıŃçīĻ
æİ¥ è¿ĳ
åĲĦ çº§
ist ance
å°ı åŃ¦
èĬ ³
æ² Ī
åıĳ çļĦ
Ġcent er
çģ Į
åºĶ å¯¹
id ence
Ġf ive
at io
å·¥ç¨ĭ å¸Ī
åĽĽ ä¸ª
c i
6 1
Ġsequ ence
Ġinit ial
å¯Ĩ åĪĩ
ide o
å¢ŀ éĢŁ
ĠI m
Ġg e
åľ° çļĦ
Ġ vert
åħģ è®¸
Ġproper ties
Ġdisc uss
Ġcol or
éĥ½ èĥ½
èĩ Ń
â ĸ
Ð ½
cc ording
Ġen ough
ä¸ĵ ç§ĳ
ä¿¡ çĶ¨
æ°´ æŀľ
Ġf ar
çļĦ ä¸ĵä¸ļ
Ġhe art
oc ol
os ed
A nd
9 1
$ :
å©´ åĦ¿
sp ec
å¨ ľ
ĠW ith
åĿ Ĭ
se arch
åī ²
åħ¬ å®ī
Ġre ason
ec ond
èĩªæ²» åĮº
amb da
ĠS he
æ³ Į
P E
St ate
ç¢ ĳ
é«ĺ è¾¾
g ress
Con fig
çĶŁæ´» çļĦ
id ing
åĪĨ ç¦»
7 1
èĻļ æĭŁ
Ġatt ack
Ġem ploy
tr ain
ĠB l
çķ ª
åĪ° åºķ
è´ ¾
Ġd est
äºº ä¸º
Ġc reat
æ·± åĮĸ
è¥¿ éĥ¨
Ġwh ite
ch ie
æµ ©
éĻ ª
E qu
< '
Ġ ur
Ġeduc ation
çĽĳ æİ§
é¢Ħ æľŁ
æľĢ å¥½çļĦ
Ġon ce
at ter
çļĦ çĶŁäº§
é¬ ¼
Ġbec ame
w here
Ġcr ate
æĿĤ å¿Ĺ
å®ŀéĻħ ä¸Ĭ
æĶ¶ åĪ°
ä¸ī å¤§
ç§ ī
Ġinter s
Ġso il
end ing
æ» ĭ
æĹ º
äº§ä¸ļ éĵ¾
200 5
ç¤¾ äº¤
çĲĥ è¿·
ä¸ŃåĽ½ çļĦ
å¹¶ éĿŀ
çĤ ¸
æµ Ĩ
ä¸Ń æľī
Ġsat isf
Ġvari ous
alcul ate
ens ion
ä¼ł æĦŁ
ç¾ ½
ä¸» æ¼Ķ
é«ĺ äºİ
y thon
Ġconsid ered
èĪŀ åı°
å°½ éĩı
éĺ² æ²»
end er
um ber
Ġth ought
å¥ Ķ
ä¸į çŁ¥éģĵ
Ġp air
Ġhow ever
av el
è§Ĥ çĤ¹
å¸¦ åĬ¨
èµ ´
Ġp red
p ri
d o
b x
Ġ q
æĽ¼ èģĶ
Ġform ula
è®© æĪĳ
çĥ ĺ
åı¸ æ³ķ
Ġh ol
m t
i xed
i ol
g h
éĽĨ æĪĲ
æľº éģĩ
m ing
i et
çªģ çĦ¶
å¥³ åĦ¿
é¥ ±
è¯ķ çĤ¹
æĹ¥ æľŁ
ä¿ Ĭ
ä¸Ń åŃ¦
æ Ĩ
åį° åº¦
èĢģ äºº
åĬŀ åŃ¦
çĹħ äºº
æıĲ éĨĴ
Ġan n
Ġf requ
c m
Ċ Ġ
Ġmax imum
ann ot
ĠIn tern
èĥ Ģ
ĠM iss
ä¹Ł è®¸
å® Ļ
} -
F ind
ç£ ·
éĴ¢ éĵģ
éĿĴ å²Ľ
æĥ³ åĪ°
æĥħ æĦŁ
éĢļ éģĵ
æį ķ
S C
Ġest ab
åĳ¼ åĲ¸
Ġpr ice
Ġcl imate
ä¸¤ äºº
ç© Ĩ
ä¹Ł èĥ½
ä¸į ç®¡
on al
p art
n ces
f low
Ġresp ons
Ġtechn ology
çĶ· åŃĲ
ell ing
ĠP ar
Ġas k
éķ Ģ
çĶ¨ äºº
alle l
Ġpart s
é£İ æľº
k n
b or
Y ou
H T
äº§çĶŁ çļĦ
ç¦ı å»º
Ġres ources
åĬ¨ ä½ľ
" ;
loc al
åį± æľº
è¶Ĭ åįĹ
Ġde ath
] :
æħ İ
æŁ¥ è¯¢
ä¼ĺ èī¯
èĩ³ äºİ
åĬł æĭ¿
Ġmult iple
Ġcount ries
çĭ Ĺ
è¥¿ äºļ
æµ ħ
çĶ¨ æĿ¥
pec ially
è¡¥ è´´
èĭ± æĸĩ
ä¿Ŀ æ¸©
æ±¡æ°´ å¤ĦçĲĨ
å¸¸è§ģ çļĦ
Ġpop ulation
æīĭ è¡¨
èĮ ¨
ç® Ń
ec e
é£ŀ æľº
åįł åľ°
åĬ¨ çĶ»
ä¸Ń æĸĩ
c ing
å·¨ å¤§
è®¿ éĹ®
ç»Ŀ å¯¹
Ġpl ants
å¸¦ çĿĢ
äº¤ æį¢
è¿ĺ ä¼ļ
æľ¬ äºº
åĬ¨ æĢģ
ä¼ļ è®¡
èµ Ķ
Ġd one
ç¦ģ åĮº
éŃ Ĥ
ĠG MT
åĻ ª
æ· Ģ
åħ¨ åĬĽ
çĶŁ æ¶¯
Ġc ustom
ä» °
I R
Ġprob ability
Ġgo ing
æł¡ éķ¿
åįģ åĽĽ
åĢ ¡
] [
Ġprot ect
ç¨İ æĶ¶
Ġqu adr
æ¯ı ä¸Ģä¸ª
æĸ° çĸĨ
t op
t em
å®īåħ¨ çĶŁäº§
è¾ ©
Ġl ink
Ġ ill
"> </
è° ¨
ç¨ Ģ
æ¸ ¡
æĹ¶ å°ļ
ä¸Ĭ ä¸ĭ
Ġanal ysis
one y
our nal
åľ° éĵģ
ä¸Ģ ç³»åĪĹ
çļĦ åĨħå®¹
âĶ Ģ
Ġneed ed
ob j
Ġme et
çº¿ è·¯
æĢ§ è´¨
ad es
m b
I nt
Ġimpro ve
Ġcle an
ä¼ĳ éĹ²
Ġsup er
ĠF ind
è¢ ĭ
qu e
Ġp ay
æĸ ¤
A G
) ^{
bl ock
Ġbl ack
æĤ ¦
æ¼ Ĥ
è¾ Ĳ
éĹ ª
ä¸Ĭ å¹´
L ONG
äººåĬĽ èµĦæºĲ
è¿Ŀ åıį
equ est
Ġexp ected
ord in
åıĺ æĪĲ
ä½Ĩ åľ¨
ä¸» åľº
Ġm ot
åį ¢
Ġcent ury
Ġsc ience
çĮ Ľ
æ¡Ī ä¾ĭ
å¤ĸ è§Ĥ
Ġcon tr
ç¨ į
çľ ł
c all
Ġfe et
å¼Ģ åĲ¯
Ġm ind
æĺ¯ æľī
Ġpat ients
Ġg round
äº ı
F rom
Ġtest s
Ġqu ality
éĩĩ è®¿
åĪ© äºļ
èģ Ĭ
èĤ ĥ
æ² ¦
ĊĠĠĠĠĠĠĠĠ ĠĠ
Ġf und
is ing
éģĹ äº§
å³ ¡
æ±Ł è¥¿
åŃĺ åĤ¨
ĠN orth
ç© ·
ĠT est
Ġn ational
} (
å¹¼ åĦ¿
æĪª æŃ¢
å½¢ åĬ¿
å¹¿ åľº
éĿ¢ è¯ķ
è¾ ¨
a ff
å« Į
éŃ ħ
åŃ¦çĶŁ çļĦ
Ġh aving
Ġs on
] ;
åį° è±¡
Ġso ftware
ast ic
æĶ¾ å¼ĥ
çĿ Ľ
éĥ¨ ä½į
èĢ Ģ
ï¼ į
çİ°ä»£ åĮĸ
åĩºçİ° äºĨ
ä¹¦ æ³ķ
pt oms
åįģ ä¸ī
æľį è£ħ
ç§į ç±»
ç¬¬ åħŃ
æ³ķ äºº
å®¶ åħ·
u el
Ġassoci ated
Ġsur face
å®ŀçİ° äºĨ
bo x
iz er
ou ri
Ġf all
f er
èĮ¶ åı¶
ä¼ĺ çĤ¹
Ġex am
å°Ĩ åħ¶
Ġl ower
ĊĊ ĠĠ
å¾ ¡
a res
R e
Ġfact ors
è¶ħ çº§
å¸Ī èĮĥ
åŁİ éķĩ
çĶµ åĻ¨
Ġl ines
Ġp aper
Ġp ubl
è¾½ å®ģ
åĳ¨ å¹´
ç«ĭ åį³
è¿Ļ ä¹Łæĺ¯
æ³ ³
o res
è¾ħ åĬ©
Ġproduct s
è½» æĿ¾
ç²¾ åĩĨ
Ġv ec
ä¿Ŀ çķĻ
æĽ °
è¿Ļ å°±æĺ¯
åĮ Ģ
C H
æĹłè®º æĺ¯
å¿«éĢŁ å¢ŀéķ¿
è¶³ å¤Ł
æĿ¥ äºĨ
çŃ Ľ
å¿ į
å¤§ éĻĨ
Ġb ool
E n
) }
Ġreg ion
æ¯ı ä¸Ģ
ĠC M
æľ¬ ä¹¦
æľī ä»Ģä¹Ī
' .
Ġactiv ity
Ġgroup s
Ġart icle
Ġstud ent
æĺİ çĻ½
sc ri
æ¯ĶèµĽ ä¸Ń
Ġro le
ç¢ °
ĠD es
æīĢ éľĢ
å¤§ å¸Ī
å¼ ĺ
Ġs ite
O D
N ame
å°Ŀ è¯ķ
Ġeffect s
åĮĹäº¬ å¸Ĥ
éĺ² æĬ¤
éĩĮ éĿ¢
æĥħ å½¢
Ġl ive
s ource
Ġmodel s
Ġsk in
ç²ī ä¸Ŀ
Ġprov ided
åİĭ ç¼©
åĲĪ çī©
çŃī çº§
Ġre ally
le ment
Ã Ĺ
æ°Ľ åĽ´
Ġdiffere nce
èį¯ åĵģ
åĳ¨ åĽ´
Ġwor d
æĶ¹ è¿Ľ
åħ¶ æ¬¡
âĢĿ ï¼Ī
25 6
æī¿ è¯º
ç©º è°ĥ
ä¸ľ åĮĹ
ä¸ľ æĸ¹
ub e
Ġlist ening
æĻļ ä¸Ĭ
åĩĢ åĮĸ
å² Ń
èº« ä¸Ĭ
æľº ç»Ħ
æŀ Ŀ
çļĦ è§Ħå®ļ
æĦŁ æĥħ
å¤ĸ åĽ½
åĮº åĪ«
è¿Ľ å±ķ
ä¸ª ç¯®æĿ¿
æ³ Ħ
g roup
æıĲåĩº äºĨ
çĶ¨ éĢĶ
Ġf ri
Ġknow ledge
ä¸¥éĩį çļĦ
åŃ©åŃĲ ä»¬
åĲ¦ åĪĻ
åĤ ¬
åįł æ¯Ķ
ç¨İ åĬ¡
åĪĩ å®ŀ
ä¸ľ åįĹ
Ġ2 1
å¦ ¹
Ġe y
çĶŁ åŃĺ
Ġgre ater
Ġpartic ip
Ġbl ock
Ġqu e
æĴ ŀ
åįı åĲĮ
åı¯ä»¥ è¯´
å°± è¦ģ
è®¾ æľī
al y
m it
å®¶ äºº
æŀ ª
åİ ¨
æ° Ł
åľ¨ è¿Ļä¸ª
Ġa chie
ĠCon t
Ġdef in
ĠN e
ab ase
ä¹ĭ è·¯
Ġw ind
Ġes pecially
Ġmem bers
IN G
è¿ĲåĬ¨ åĳĺ
čĊ čĊĠĠĠĠ
åı¤ ä»£
åĭ ĥ
æĳ ĩ
æĤ Ł
å®Į ç¾İ
èµ· åĪ°
Ġr a
se qu
æĹ¥ åŃĲ
åĪ° è¾¾
ion e
ĠSt ate
ok en
Ġse par
éģ ¥
å¤ļ é¡¹
å½ °
ä¸ ¢
Ġbuild ing
____ ____
Ġprodu ction
Ġwho le
ç¢ §
åĳ¨ è¾¹
å¾Ī å®¹æĺĵ
ĠC ons
åħ¨ å¹´
åĩº æĿ¥çļĦ
æľī æĹ¶
Ġp age
s k
h ost
èĦĤ èĤ
èĦĤèĤ ª
Ġpre vious
è®² è¿°
ç»Ĩ èĬĤ
Ġcomp on
ag ing
Ġst ory
ĠC L
ig ure
le g
Ġp ri
èģĮä¸ļ æķĻèĤ²
åĬŁ çİĩ
ust er
Ġhe ight
æ¡ Į
iv ity
éĥ½ åı¯ä»¥
el ine
äºº ç¾¤
ĠCom p
é¸ £
æ¿Ģ åħī
ä¸ĭ åĪĹ
åĪĨ æ³Į
æĺ¯ ä¸ª
en n
æĿŃ å·ŀ
å®ĩ å®Ļ
Ġacc ording
æµģ éĩı
æ¡ ¶
å½ĵ å¹´
è¾ Ī
çļĦ èĥ½åĬĽ
v ing
Ġlim it
å°Ĭ éĩį
æ¸© æļĸ
æĢ» éĥ¨
ay out
re en
è¾Ĳ å°Ħ
çĥĪ çļĦ
è½¬ æį¢
her n
im ent
åľ¨ è¿ĻéĩĮ
R ead
Ġnecess ary
Ġdoc ument
Ġincre asing
plic ations
Ġind ex
æķ´ çĲĨ
æĪĺ äºī
Ġch all
ç§į åŃĲ
æĻ °
ĠS up
éĢ ¾
ä¸Ģ çº§
8 00
Ġinequ ality
éĶĢ éĩı
è¯ģ æį®
è·¯ çº¿
èĭ ¯
d frac
äºĭå®ŀ ä¸Ĭ
äºĭä¸ļ åįķä½į
Ġro ot
erv ice
å·´ è¥¿
ç§ĳåŃ¦ å®¶
é¢ Ī
im g
åħ Ħ
b eta
Ġbas ic
çĥŃ æĥħ
Ġde g
ĠD r
Ġit self
ĠC ar
æĮ ¡
ä¸Ĭ åįĬå¹´
åĴĮ è°Ĳ
Ġt aken
ï¼ Ĳ
b ody
åĲĮåŃ¦ ä»¬
æ¬§ åĨł
èŀį åħ¥
èĤ¡ æĿĥ
å¹³ æĹ¶
ect ions
åħ¬ æ°ĳ
åŁ ĭ
C L
Ġ row
æµĵ åº¦
å¯Ĩ åº¦
éĶ »
ĠS ub
Ġh old
åıĳ æĺİ
r ary
Ġproper ty
æľīæķĪ çļĦ
Ġob serv
Ġse en
çĬ ¹
åĮ» å¸Ī
åħ³ å¿ĥ
ä¹Ł å°Ĩ
ä¸ ²
Ã Ń
tools hed
æĹħ è¡Į
Ġcont ext
ps u
æ¡ Ĥ
å¤© çļĦ
qu ery
æľī åĬ©
Ġt akes
Ġent ire
è®² è§£
åıĸ æ¶Ī
å¼Ģ æĭĵ
æĹ¥ çļĦ
iss ions
åº· å¤į
ä»ĸ è¯´
åĪĨ æķ°
éĶĪ éĴ¢
Ġorig in
ä¾ĽåºĶ åķĨ
Ġche m
çĸ¾çĹħ çļĦ
ä¾¿ åĪ©
æĪĲä¸º äºĨ
åĩº åıĳ
Ġc ut
åı ł
çļĦ åŁºæľ¬
çļĦ ä¿¡æģ¯
ĠĠ Ċĉĉ
o ber
Con t
æĹł çº¿
T E
P O
èĪĴ éĢĤ
Ġj ob
äºĶ å¹´
éħ ±
éķ¿ æĹ¶éĹ´
å¤§ å°ı
c urrent
Ġsk ills
é¹ ı
ĠHe alth
Ġrel ig
éļı æĹ¶
ç§° åı·
ĠD ep
am ent
åħ¬ åĬ¡
S c
éŀ ĭ
Ġactiv ities
è¾ĥ é«ĺ
è½¦ ç«Ļ
Ġr ather
ä»£ è°¢
Ġg lobal
Ġd u
b on
Ġmin utes
åĪĨåĪ« ä¸º
Ġim m
ĠG e
åĲį çļĦ
ä¹Ł è¦ģ
å¤ļ å®¶
åĽ½ æ°ĳ
æĺ¯ ä»¥
Ġinf lu
çħ ®
å¤© ä¸ĭ
Ġc ity
ĠĠĠĠ ĠĠĠ
Ġreg ular
è¯Ħ å®¡
çī© ä¸ļ
æľ¬ èµĽåŃ£
b its
Ġfun ctions
å®ĺ ç½ĳ
å°¼ äºļ
æł¼ åħ°
Ġre v
ar ies
at ory
o es
I I
B ut
å¥ĭ æĸĹ
å·¨ å¤§çļĦ
ä¼łç»Ł çļĦ
èĪª å¤©
ä¿® å¤į
éħ ¶
Ġe ff
ç²® é£Ł
mat rix
ward s
Ġact ually
ĠTh us
æĤ ł
éª Ĺ
éĴ »
æĺ¯ åĽłä¸º
n ext
Ġmeas ure
é¡¾ å®¢
æµģ è¡Į
è¯´ çļĦ
è¿ĺ èĥ½
æĸ¹ ä½į
v ec
i ation
5 000
ron t
Ġadd ed
æĵ ¦
è®¤ çŁ¥
å°ı ç¼ĸ
æĮ ¤
åĩº å¸Ń
çº ł
éĢ Ĭ
èĬ¯ çīĩ
Ġgre en
è¡Ģ æ¶²
åĨį çĶŁ
up t
Ġwe ek
æ¯ ģ
el ves
Ġs ix
æĬĳ åĪ¶
ĠTh at
so ft
æĶ¶ è´¹
Ġst ates
im al
st d
è´ º
L O
èĽĭçĻ½ è´¨
IS O
èĵ Ħ
å¤Ħ ç½®
éĶ Ĥ
